{"attack":{"berserkersfury":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEifeHuJiHoM5ciuVS1ByFwqqnWsPwW49y-EfOcttB9UxkklxkrprnvArLzxMRnA5_P_IHvNblFTKsfi2uENpnxtGMomzVpGvQqwcpxEf2JWbbXsGnomyjXaEGcxREiH6Ov5RW_YDl90LWO9iVl-HoKKwpCBWWWFeoLeS1iOzmFt_2bmvTpjeMz3KjcPIA/s1920/bersekers-fury-png.png","name":"Berserker’s Fury","description":"\\n**Berserker’s Fury**\\n\\nBerserker’s Fury is an attack item that provides the following bonuses:\\n\\n- +65 physical attack\\n- +25% critical chance\\n\\nIn addition, it possesses a unique attribute:\\n\\n- Increases critical damage by 40%\\n\\nFurthermore, it has a unique passive:\\n\\n- Grants 5% extra physical attack for 2 seconds after a critical strike1\\n\\nThis item is particularly well-suited for physical heroes who heavily rely on critical damage, including Ling, Granger, Lesley, and Moskov2.\\n\\nBerserker’s Fury can be obtained at the cost of 2250 gold and can be upgraded from the combination of Legion Sword and Javelin."},"bladeofdespair":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgclT6Qn7HBApbgkwoGp5-S07eWofYmCT3boRwXndA3wx9PlgU1jQR22Izft-sF-30-7zAzTXnxcj7AjFKBy3qAI0NzJ63mFU8ymAEvRWXkDLtBDiiR-iN6ylmf0B7kqPMcIejlwR5vJlNiFgRAKlKCLyC4vWaRtYNrCnQlp-GhkbDRjhG8zNKHm-jmcQ/s960/blade-of-despair-png.png","name":"Blade of Despair","description":"**Blade of Despair**\\n\\nBlade of Despair is a powerful item with the following attributes:\\n\\n- +160 Physical Attack\\n- +5% Movement Speed\\n\\nIt possesses a unique passive called \\\"Despair\\\" with the following effect:\\n\\n- Attacking enemies below 50% HP grants 25% extra Physical Attack for 2 seconds (this bonus is applied before dealing damage).\\n\\nBlade of Despair is considered one of the most potent items in the game due to its high boost in physical attack, surpassing any other equipment12. It is particularly effective for physical heroes whose skills scale well in the later stages of the game. However, it is generally not recommended to purchase this item during the early to middle phases of a match1. \\n\\nSeveral heroes can greatly benefit from Blade of Despair, including Wanwan, Ling, Granger, Lancelot, Helcurt, and Claude. These heroes have abilities that synergize well with the increased physical attack and can make optimal use of the item's potential."},"bladeofheptaseas":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhYm_yalQv9R3N1TYC3tTGE-SXXMzdrWM5cGRUxSioCMJhbz4S30NgDwq3Js-5uiGL-RIP621n9XzDpGnQbjGFavx2x4NCH-RlCLV08tu_78VswhdidEV5OLuyxPNGXiEmXpzi2axt-XnXmyMA9zf7_r5OzJCbULE3yCOrhLpbI2R0xPqaoKlAkduA-Cw/s960/blade-of-heptaseas-png.png","name":"Blade of Heptaseas","description":"**Blade of Heptaseas**\\n\\nBlade of Heptaseas is an item that provides the following bonuses:\\n\\n• +250 HP\\n• +70 Physical ATK\\n• +15 Physical PEN\\n\\nIt features a unique passive called \\\"Ambush\\\" with the following effect:\\n\\n- If no damage is taken or dealt within 5 seconds, the next Basic Attack will deal extra Physical Damage equal to 160 plus 40% of Physical Attack. Additionally, it inflicts a 40% slow effect on the target for 1.5 seconds.\\n\\nBlade of Heptaseas is a valuable item for physical assassins who require increased damage output and improved crowd control abilities1. Additionally, when using a skill, it reduces the target's physical defense by 25 points for 3 seconds2. \\n\\nSeveral heroes can greatly benefit from Blade of Heptaseas, including Ling, Saber, Lancelot, Hayabusa, and Fanny. These heroes can take advantage of the item's bonuses and unique effects to enhance their damage potential and control over the battlefield."},"bloodlustaxe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhAT9a_lM9f-rnxKP81ds7LbN5r9j0_5KEMo4fHGCxHmcdaNAWP4XBj7spw5v6g3D1A_dkKnxwDQnTi5OdR-Ll_7BAlKYFfKsEp-ksqBIf0Tx9iwKxFOVdhJtgLUa_gHSyNUQRp7aXER_GccdBok47yh6fchUHmaa_n2jYjG6gK1obN5Q9ZNvQk7NzBHw/s960/blood-axe-png.png","name":"Bloodlust Axe","description":"**Bloodlust Axe**\n\nBloodlust Axe is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +10% Cooldown Reduction\n• Unique: +20% Spell Vamp\n\nThis item proves to be highly valuable for fighters or assassins who heavily rely on their skills to deal damage, as it enhances their survivability while dealing significant damage1. It allows them to recover a percentage of the damage dealt by their skills as health2.\n\nSeveral heroes can greatly benefit from Bloodlust Axe, including X.Borg, Dyrroth, Terizla, Granger, Leomord, and Fanny2. These heroes possess skills that synergize well with the item's effects, enabling them to sustain themselves in battles and stay in the fight longer."},"corrosionscythe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgpKivIV6uE0lXqWofeGHTATmLG0kS-3UPS4oP6d1R4Ai30_UXqOATty4ihlTlT6BKImcuLKzUNgoePD7SkQQp2CAPmQMjO13TjCApeExBal8QX__2DlPZ-AfEPpzD6iLYZxuKsn_lvoTcuzel5PwTDTHHEh-WdRmEads4I-x8-yBkbh-U-db5qXDj8Pw/s1920/corrosion-scythe.png","name":"Corrosion Scythe","description":"Corrosion Scythe\n\nCorrosion Scythe is an item that provides the following bonuses:\n\n+50 Physical ATK\n+25% Attack Speed\n+5% Movement SPD\nThis item has two unique passives that enhance your basic attacks. The first one is Distortion, which gives your basic attacks a chance to slow down the enemy’s movement speed by 50% for melee attacks or 20% for ranged attacks1. The second one is Impulse, which increases your attack damage by 8% each time you deal damage with your basic attacks. This effect can stack up to 5 times and lasts for 3 seconds.\n\nThis item is ideal for heroes who rely on their attack speed and basic attacks to deal damage, such as Wanwan, Masha, Sun, Hanzo, Claude, and Miya. These heroes can use Corrosion Scythe to chase down their enemies, kite them, and deal more damage over time."},"demonhuntersword":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi0QBNKZEa9F_eBJTCVn70ibELuqkyF0SM3mQjQbbKBWc3ISVQsr_j0xAcKKNXQ-2IGfvnCFV72mWnSWQXqllXlkmGmXzDz6wgoPp5tlTf1NVwbh4pkDLh_lhpk3ARSahI1lA-DPpvvyqzm-eL_Ai4nFP2-uBw1_mYuKHnf4nGsuR7hIvtjK1uT8ITnFg/s1920/demon-hunter-sword-png.png","name":"Demon Hunter Sword","description":"Demon Hunter Sword\n\nDemon Hunter Sword is an item that provides the following bonuses:\n\n+35 Physical ATK\n+25% Attack Speed\nThis item has two unique passives that boost your damage output. The first one is Devour, which makes your basic attacks deal 9% of the target’s current HP as additional physical damage (up to 60 against creeps and minions)1. The second one is Licking Swallow, which grants you 4% Physical Lifesteal for each basic attack for 3 seconds. This effect can stack up to 5 times.\n\nThis item is ideal for heroes who want to counter tanks and heroes with high HP, such as Wanwan, Masha, Badang, Sun, Natalia, Lesley, Layla, Helcurt, Hanabi, Claude, Bruno, and Argus. These heroes can use Demon Hunter Sword to deal more damage based on the enemy’s HP and heal themselves with their basic attacks."},"endlessbattle":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjLu7hJ4BG2S0dWD0J6xpd7v9MMRMVwSZySNdSYIiaRFpniG4Tn9SRUH3CCV3la302vOaYVTApCs2zdPlroqN09PQun8rEV6oSofkma9qahGY_fKJtcA3gBZE1n7efK0YTuobXcwYmJOd75MzzaKa8zTGf0rpmLPcqpIFpwvIn17uSJuhSGuqQHYvG-pA/s1920/endless-battle-png.png","name":"Endless Battle","description":"**Endless Battle**\n\nEndless Battle is an item that provides the following bonuses:\n\n• +65 Physical ATK\n• +25 Mana Regen\n• +250 HP\n• +10% Cooldown Reduction\n• +5% Movement Speed\n• +15% Physical Lifesteal\n\nThis item has two unique passives that enhance your damage and mobility. The first one is **Divine Justice**, which makes your first basic attack after using a skill deal 85% additional physical and true damage. This effect has a cooldown of 1.5 seconds¹. The second one is **Chase Fate**, which increases your movement speed by 10% when the Divine Justice effect is triggered¹.\n\nThis item is ideal for physical heroes who use skills and basic attacks in combination, such as Popol, Ling, X.Borg, Dyrroth, Terizla, Granger, Saber, Ruby, Roger, Natalia, Moskov, Martis, Lesley, Leomord, Lapu-Lapu, Lancelot, Jawhead, Irithel, Hayabusa, Hanzo, Claude, Clint, Bane, Aldous (Aulrad), Alucard and Alpha². These heroes can use Endless Battle to deal more damage with their basic attacks and chase down their enemies with increased movement speed³.\n"},"goldenstaff":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbdcGur8bxvCHeuojnPsRGKvuzdBS2iFxkIWSVorLD_yJoTstFQI4JtSuyFDboTFZ4CYnEVhIUAjNr9dGXXc_6ZNYlaGfl29jObEp_YtYEvyiUyKGfO_Hr8eNTbjyx3yFAsqfw4gDtInTRkGYruml5k4K05c_UI-SgMX-Izs_pxidlQikTBKrpNmNJ_g/s1920/golden-staff-png.png","name":"Golden Staff","description":"**Golden Staff**\n\nGolden Staff is an item that provides the following bonuses:\n\n• +65 Physical ATK\n• +30% Attack Speed\n\nThis item has two unique passives that boost your attack speed and damage. The first one is **Swift**, which makes you unable to increase your critical chance, but increases your attack speed by 1% for every 1% critical chance you have. The second one is **Endless Strike**, which makes your basic attacks add an infinite stack of hits. After 2 stacks have accumulated, the next basic attack is triggered 3 times.\n\nThis item is ideal for heroes who have skills or passives that can trigger the effect of their basic attacks multiple times, such as Popol, Badang, Claude, Karrie, and Miya. These heroes can use Golden Staff to deal more damage with their basic attacks and increase their attack speed without relying on critical chance.\n\n"},"haassclaws":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqrPaAMBgEx1SmA8f8Bbgi3253Dp9-tZKPj0sRPKU4mNZGNFyLrSrAhfK9CDlPpAX91fo-rjWN1q7r3Ec4Jj7v0xsoJFtKsq48sWojwt2F3XAw60F8jyLUxjOrgabHeTTeoOWcIIuIVKjN6P7XIu2h0hnvZc1K112n_vSStas-XqEWahXnLrjsNiuyAw/s1920/haas-claw-png.png","name":"Haas's Claws","description":"**Haas's Claws**\n\nHaas's Claws is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +25% Physical Lifesteal\n\nThis item has a unique passive that increases your survivability when your HP is low. The passive is **Insanity**, which grants you an extra 15% Physical Lifesteal when your HP drops below 50%.\n\nThis item is ideal for heroes who want to sustain themselves in fights with their basic attacks, such as Zilong, Yisunshin, Ruby, Moskov, Layla, Hanabi, Freya, Clint, Argus, Alucard and Miya. These heroes can use Haas's Claws to heal themselves by dealing damage and stay longer in battles."},"hunterstrike":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjjepr5MMzNDnyfjRyMy74pGt2j-vAVWDd3lLn7ftIjQRGBqPFesqyEbzi2jE6bQ9VKNg9dsgLBza1eMRTLr6QOf6dEzOY4Ed9GP-7GO5G2y52UJk2HTPlLQgvkOVxoQ0CwB4HiWyi4JQVAS_890V1ughoUceRcmML00uI5t4cz0s1TSXL-ucu5A3V_AQ/s955/hunter-strike-png.png","name":"Hunter Strike","description":"**Hunter Strike**\n\nHunter Strike is an item that provides the following bonuses:\n\n• +100 Physical ATK\n• +10% Cooldown Reduction\n\nThis item has a unique passive that increases your movement speed when you attack the enemy multiple times. The passive is **Hunt**, which increases your movement speed by 30% for 2 seconds when you attack the enemy 5 times in a row. This effect has a cooldown of 15 seconds.\n\nThis item is ideal for heroes who are physical assassins that need to deal more damage and increase their mobility, such as Jawhead, Hilda, Lancelot, Hayabusa, Helcurt, Natalia, and Saber. These heroes can use Hunter Strike to chase down their targets and escape from danger with increased movement speed."},"maleficroar":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiTTHjEv4XDzR59kaoF91lTeYOwvod4kAF82BeLHFI3PpVC1mHub_0xIDLMlz52-yYga1t2YeyeV7bVGqXWQ8Vp4QJQt3X5snoVHaYERnMCNHHbXb4FHLqACWJEgtnDo57CPALS-8N8_Jry-0wwxVbNZpCMXJeIoinRCfAmIxUsOUTJpwphs-tf7DcWwg/s1903/malefic-roar-png.png","name":"Malefic Roar","description":"**Malefic Roar**\n\nMalefic Roar is an item that provides the following bonuses:\n\n• +60 Physical ATK\n• +35% Physical Penetration\n\nThis item has a unique passive that increases your damage against enemies with high physical defense. The passive is **Armor Buster**, which increases your physical penetration by 0.05% for each point of the enemy's physical defense when you deal damage to them, capped at 20%.\n\nThis item is ideal for heroes who want to counter enemy heroes or turrets that have high physical defense, such as Yisunshin, Saber, Lesley, Clint, Bruno and Zilong. These heroes can use Malefic Roar to deal more damage with their basic attacks and skills and destroy turrets faster."},"rosegoldmeteor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxL44vyipJkxjpWluAcWxFKK-eZQOfoBzAH-1g4ZMWjekDRcXD3Z6NRfh1AtJj-sWYox1JBiZl0aB62W4OGB_ufuCYFg7cGKgUVtI8Qh4LA5uWUsEI0Q40DsOwSQJhfqXAWnEoS6Kl6xhSDEfUs9e8eLPDzvaALiYiquGH1cxtboyU4kmGCqbSicaMCA/s960/rose-gold-meteor-png.png","name":"Rose Gold Meteor","description":"**Rose Gold Meteor**\n\nRose Gold Meteor is an item that provides the following bonuses:\n\n- +60 Physical ATK\n- +30 Magic Resistance\n- +5% Physical Lifesteal\n\nThis item has a unique passive that creates a shield when your HP is low. The passive is **Lifeline**, which creates a shield that absorbs 510-1350 damage (increases with level), which lasts for 3 seconds when your HP drops below 30%. This effect has a cooldown of 40 seconds.\n\nThis item is ideal for heroes who want to survive against magic burst damage and deal physical damage, such as Popol, Saber, Layla, Lancelot, Hayabusa, Claude and Alpha. These heroes can use Rose Gold Meteor to protect themselves from dying and heal themselves with their lifesteal."},"scarletphantom":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEheln5gfDEkzOPyb2ZhDu35Fo5qJHjqaae8NtMt-SAYACcARz-M8b79ozHYeQCLPCdbCtJYkmp5pNMJ5ge_k9232vqUc4Q7Ve_wqeIoLqvY4zT-hXUQesG1fJDeXvjMLUesxz3TGCQS6nxfqSFGnNDU4QE2ODp-dHDt_SF5kiXsoiLzbFqnCgzt04qLtQ/s960/scarlet-phantom-png.png","name":"Scarlet Phantom","description":"**Scarlet Phantom**\n\nScarlet Phantom is an item that provides the following bonuses:\n\n- +30 Physical ATK\n- +20% Attack Speed\n- +25% Critical Chance\n\nThis item has a unique passive that increases your attack speed and critical chance when you land a critical hit. The passive is **Frenzy**, which increases your attack speed by 25% and critical chance by 5% for 2 seconds when you land a critical hit.\n\nThis item is ideal for heroes who rely on high attack speed and critical chance to deal more damage, such as Wanwan, Zilong, Yisunshin, Roger, Natalia, Moskov, Irithel, Hanabi, Freya, Clint and Alucard. These heroes can use Scarlet Phantom to deal more attacks faster and increase their chances of landing critical hits."},"seahalberd":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh5wYi3YNEdtizMoSP8PxOzKiflLjArWsttHs7x_Jgy7BfkcSp99JK6m4FKcgweBPtODyy_GS8Cd2c8Ux4CRybr0z16fCAse7XiitoqKmCHfkYjTaX3H3pjnChaDxuZZZSLISpPIaa0RJYfip7MsnW8yfYaF52Wr9E63-cL0Gg4BFlUrB9xL8H6mgbGMw/s949/sea-healberd-png.png","name":"Sea Halberd","description":"**Sea Halberd**\n\nSea Halberd is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +25% Attack Speed\n\nThis item has two unique passives that reduce the enemy's healing and deal more damage to enemies with high HP. The first one is **Life Drain**, which reduces the enemy's HP regen and shield effects by 50% for 3 seconds when you deal damage to them¹. The second one is **Punish**, which increases your damage by 8% against enemy heroes with higher extra HP.\n\nThis item is ideal for heroes who want to counter enemies who have high regen or lifesteal effects, such as Popol, Saber, Moskov, Granger, Karrie, and Claude. These heroes can use Sea Halberd to prevent the enemy from healing themselves and deal more damage based on their HP."},"waraxe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEghH2rZdojf9dGh-mC534flj2ZQ6LrTIFjR7q750cKORYbAAiS9ZCSgUg7RELOfxfX1L0Nt1gNhqqzoWD6M2dLeor8-f1qvKs4Q_qOBmkHVgFlYM95TyHwikozVGZZNtqWSRygRA4QOQfexeDgAAjTDYYt3z2gi8cJPstt36FPqkoFltdSLEnQWECz6Kw/s1920/war-axe-png.png","name":"War Axe","description":"**War Axe**\n\nWar Axe is an item that provides the following bonuses:\n\n• +550 HP\n• +35 Physical ATK\n• +10% Cooldown Reduction\n\nThis item has a unique passive that increases your physical attack and penetration when you deal damage to enemies. The passive is **Fighting Spirit**, which increases your physical attack by 9 and physical penetration by 3 each second for 3 seconds when you deal damage to any enemy unit, to a max of 8 stacks. Marksmen, mages, and supports only receive 33% of these stacked effects. It also grants you 15% movement speed at full stacks.\n\nThis item is ideal for fighters who need good sustainability and damage output, such as Aulus, Thamuz, Yu Zhong, Ruby, Lapu-Lapu, Terizla, and Freya. These heroes can use War Axe to improve their durability, cooldown reduction, and damage potential."},"windofnature":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSYxyMVsYuU7hda1kh90H7KW_6OFOmlKdNaqOkftqhlBQD45LcwhvAiIZ6YE8AXqK3QkBdsVceUcp7VYSYcjQN2mkCv1JIYjUxIlvMQv5gWFrgV6rlY6dabxvlqlYQ-nXEwmymcP4Eoo720qSLlHHAPHCOjTE3-0yq8HxjuF1FIZPZMp3SZpBYkzohpw/s1920/wind-of-nature-png.png","name":"Wind of Nature","description":"**Wind of Nature**\n\nWind of Nature is an item that provides the following bonuses:\n\n• +30 Physical ATK\n• +20% Attack Speed\n• +10% Physical Lifesteal\n\nThis item has a unique active skill that makes you immune to physical damage for a short duration. The skill is **Nature Wind**, which makes you immune to all physical attacks for 2 seconds. There is a cooldown of 80 seconds. The duration is halved when the item is not used by a marksman.\n\nThis item is ideal for marksmen who want to survive against physical burst damage from enemies, such as Granger, Aldous, Helcurt, Hayabusa, and Claude. These marksmen can use Wind of Nature to protect themselves from dying and heal themselves with their lifesteal."},"windtalker":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDR1fq2N8-Vf0x6-_bxDS7QmHLJLFk1IPtRRC8hZ17ByG-MwjDgy07eTjGjn1qdml2VCWbMR2vVWGL2nAnro1dZeH6xsn0i0oCevzsmY2Et6gMK8c7_ohjQMYpjww7YHc2K6PrT7jZXKsNsFja02DJvwMDEpe6y737O_DR-PENUoM2gnszDBYFblgNjQ/s1903/windtalker-png.png","name":"Windtalker","description":"**Windtalker**\n\nWindtalker is an item that provides the following bonuses:\n\n• +40% Attack Speed\n• +20 Movement Speed\n• +10% Critical Chance\n\nThis item has two unique passives that enhance your basic attacks with magic damage and movement speed. The first one is **Typhoon**, which makes your basic attacks every 3.5 seconds hit 3 enemy units and deal 100 magic damage. While your critical chance and attack speed increase, the cooldown of this effect decreases¹. The second one is **Activate**, which increases your movement speed by 5% for a short time each time Typhoon is used.\n\nThis item is ideal for marksmen who want to improve their attack speed and critical chance, such as Wanwan, Yisunshin, Lesley, Layla, Helcurt, Hanabi, Clint, Bruno, and Miya. These marksmen can use Windtalker to deal more attacks faster and deal extra magic damage with their basic attacks."}},"mage":{"bloodwings":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjUrXotNHT82nZKXrOurnPl2ML8gYkexrVl_USNY6Hwbp3_SD2cpN1eFsHVTHJwiLfW-PL4O07qfmIVJ9C7drU9P_jQejiNNTECaxYU56FrfDUxdNgUC0US6xgzvyJuuMTt0m-D8JFjJUgqSS0-fcHcn2WX8iKnhNZgfgOgjCufgXN71oX9NkKxrSDcyg/s1920/blood-wings-png.png","name":"Blood Wings","description":"\n# Blood Wings\n+150 Magic Power\n+500 Health\n\n**Unique Passive - Nirvana**: Adds 1.5 HP for every 1 magic power added.\n\nBlood Wings is a great item for magic heroes who need more survivability and burst damage in the late game. It gives you a shield equal to 200% of your magic power that regenerates 20 seconds after being damaged and grants 30 movement speed while it lasts. It is recommended to buy it as the last item, as it scales with your total magic power.\n\nBlood Wings is suitable for heroes who have high magic power or can benefit from extra health, such as Lylia, Valir, Odette, Karina, Harith, Fasha, Eudora, Cyclops, Chang'e and Aurora. It can also synergize well with other items that boost your magic power, such as Holy Crystal, Clock of Destiny and Genius Wand. It can also be enhanced by Oracle, which increases the shield by 30%.\n\nBlood Wings is a powerful item that can make you a formidable mage in Mobile Legends. However, it is also very expensive and takes up a slot in your inventory. You should consider your team composition, enemy lineup and game situation before buying it. You should also be careful of enemies who can reduce your magic power or shield, such as Karrie, Helcurt and Necklace of Durance."},"calamityreaper":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgnv3QtDF10JT5QXuJ8n61fSb0Ua_5amcXqZoODo-2D97A9lycsTklMhCHLR7uU1MkX-4TejwzMrNeZ3wiGhWMZfqAEltnN4q84DgsYbytlxWkV-jY0q9Xqx8NhED5DNafW7txpl_wpBETd2Bv9UmNCX5V4kfvTZ0zTK8CF6vjTiX9DnHhktg7Pd122Ww/w320-h320/calamity-reaper-png.png","name":"Calamity Reaper","description":"\n# Calamity Reaper\n\nCalamity Reaper is a magic item that provides the following benefits:\n\n- +70 magic power\n- +100 mana\n- +10% cooldown reduction\n- +30 mana regen\n\nIt costs 1950 gold and can be built from Azure Blade and Magic Wand.\n\n## Passive Effect\n\nCalamity Reaper has a unique passive effect called Calamity. This effect allows the user to deal additional true damage with their next basic attack after using a skill. The true damage is equal to 120% of their magic power and has a cooldown of 1.5 seconds. The user also gains 10% movement speed for a short time after triggering the effect.\n\n## Usage\n\nCalamity Reaper is a suitable item for magic damage heroes who rely on their basic attacks as well as their skills. It can enhance their burst damage and mobility, especially for mage assassins like Gusion, Karina and Selena. It can also synergize well with other items that have similar effects, such as Shadow Twinblades and Endless Battle.\n\nCalamity Reaper can be used to quickly clear minion waves, jungle monsters and objectives by using a skill and then following up with a basic attack. It can also be used to harass enemies in lane or team fights by poking them with skills and basic attacks. The true damage can bypass any magic resistance or shields that the enemies have.\n\nHowever, Calamity Reaper also has some drawbacks. It requires the user to be close enough to the enemy to land their basic attack, which can expose them to danger or crowd control. It also has a relatively high cost and low mana regen compared to other magic items. Therefore, it is not recommended for heroes who need more sustain or survivability in fights.\n\n## Conclusion\n\nCalamity Reaper is a powerful item that can boost the damage and mobility of magic heroes who use their basic attacks frequently. It is best suited for mage assassins who can quickly execute their targets with skills and basic attacks. However, it also has some risks and limitations that should be considered before buying it."},"clockofdestiny":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjef29ZQ3fv_MgPF6WaW1ohqX7NAVJ9VzND6IXgX-KZBZ7obd6CJsLG880-WJy9BvsUOTwJYaIJ-r3ctn5Xr8IeHWJRSBjVR-Xe3bmOXgK7ER4ATGvi90-m_xNut8bgtqwk5rp_jy1eIXXeaSfcmAoBWhyZT5_ZoQGbNl3e6Bu1MO18Wgw2AYk2k9se2g/s1907/clock-of-destiny-png.png","name":"Clock of Destiny","description":"# Clock of Destiny\n\nClock of Destiny is a magic item that provides the following benefits:\n\n- +60 magic power\n- +615 HP\n- +600 mana\n\nIt costs 1950 gold and can be built from Elegant Gem and Magic Wand.\n\n## Passive Effect\n\nClock of Destiny has two unique passive effects called Time and Reincarnate. Time increases the user's HP and magic power by 30 and 5 respectively every 30 seconds, up to 10 times. Reincarnate activates when Time reaches the maximum stacks, granting the user an extra 5% magic power and 300 mana.\n\n## Usage\n\nClock of Destiny is a suitable item for magic heroes who need more durability and scaling damage in the late game. It can boost their survivability and mana pool, as well as their magic power over time. It can also synergize well with other items that benefit from high magic power or mana, such as Lightning Truncheon, Holy Crystal and Ice Queen Wand.\n\nClock of Destiny can be used to make the user more tanky and harder to kill in fights, especially for heroes who have shields or healing abilities such as Alice, Esmeralda and Cecilion. It can also be used to increase the user's damage output as the game progresses, especially for heroes who have high burst or poke potential such as Lunox, Kagura and Selena.\n\nHowever, Clock of Destiny also has some drawbacks. It requires the user to wait for a long time before reaching its full potential, which can make them weaker in the early game. It also does not provide any cooldown reduction or spell vamp, which are important stats for many magic heroes. Therefore, it is not recommended for heroes who need more utility or sustain in fights.\n\n## Conclusion\n\nClock of Destiny is a powerful item that can increase the durability and damage of magic heroes who scale well into the late game. It is best suited for heroes who can survive long enough to stack up their magic power and mana. However, it also has some risks and limitations that should be considered before buying it.\n"},"concentratedenergy":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjkGb9K8RfDNdS3NRwPS6EaEKMkp274g6hjxFikrrCrsD226b6bxtbR0lECFSyD5AcepLUaCTwO7SN3v3rfOSjPOhI5ZnQqul6qgAvnHVAPgZfgLRyOR9E0itdFTZCq6eBWLojzy1IHMFUg0DN2LU3CwLm5i-_qwj29s_IU1HfeCnOzI6gltiLX3DSSnQ/s1920/concentrated-energy-png.png","name":"Concentrated Energy","description":"# Concentrated Energy\nConcentrated Energy is an equipment item in Mobile Legends that provides high magic power and health, as well as increasing the magic lifesteal and restoring some health after killing an enemy hero.\n\n## Item Stats\n- **Magic Power**: +70\n- **Health**: +700\n\n## Item Passive\n- **Magic Lifesteal**: +25%\n- **Recharge**: Killing an enemy hero restores 10% of the hero's maximum HP.\n\n## Item Tips\n- Concentrated Energy is best equipped by heroes who can benefit from the magic lifesteal and health restoration effects, as well as the high magic power and health.\n- Concentrated Energy can help you sustain longer in teamfights and recover faster from damage, especially if you have skills that deal high damage or have low cooldowns.\n- Concentrated Energy can also synergize well with other items that provide magic power or health, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Clock of Destiny, to increase your damage output and survivability.\n- Concentrated Energy is not very effective against enemies that have high magic resistance or magic damage reduction. In that case, items that provide magic penetration or more damage may be better.\n\n## Item Usage\n- Concentrated Energy can be used in any game mode where there are enemy heroes that deal low magic damage or have low burst damage.\n- Concentrated Energy can be purchased mid or late game to increase your magic power and health.\n- Concentrated Energy can be used by any hero that needs magic power and health, but especially by heroes that have high damage skills or passive effects, such as Cecilion, Carmilla, Silvanna, Guinevere, Selena, Odette, Nana, Kimmy, Karina, Harley, Harith, Gusion etc.\n"},"divineglaive":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNRkjLeiEQR1bWSFFFmKL2agJ06LvHIy8F-0Oz-iYuWK1LeV0BRUWAQnHAjFHOkSR18g72mLq7N_IzEjQKR5bPkemEaCeDHQ8Wioy5q-XRJjCz59q_m8ZijZ--yb1f40YaoN1lYSkOvo0Y1whbV3q4drrWEp6O68vFhvWIiDp91L1kXNGWtrpk5O7caA/s960/divine-glaive-png.png","name":"Divine Glaive","description":"# Divine Glaive\nDivine Glaive is an equipment item in Mobile Legends that provides high magic power and magic penetration, as well as increasing the magic penetration further when the hero's health is high.\n\n## Item Stats\n- **Magic Power**: +65\n\n## Item Passive\n- **Magic PEN**: +35%\n- **Spellbreaker**: When the hero's HP is higher than 70%, the magic penetration effect is increased by 30%.\n\n## Item Tips\n- Divine Glaive is best equipped by heroes who can benefit from the high magic penetration effect, as well as the high magic power.\n- Divine Glaive can help you deal more damage to enemy heroes that have high magic defense or shields, such as Esmeralda, Lolita, Hylos, etc.\n- Divine Glaive can also synergize well with other items that provide magic power or magic penetration, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Genius Wand, to increase your damage output and effectiveness.\n- Divine Glaive is not very effective against enemies that have low magic defense or magic damage reduction. In that case, items that provide more damage or cooldown reduction may be better.\n\n## Item Usage\n- Divine Glaive can be used in any game mode where there are enemy heroes that have high magic defense or shields.\n- Divine Glaive can be purchased mid or late game to increase your magic power and magic penetration.\n- Divine Glaive can be used by any hero that needs magic power and magic penetration, but especially by heroes that have high damage skills or passive effects, such as Silvanna, Zhask, Lunox, Kimmy, Karina, Kadita, Harley, Gord, Fasha etc."},"enchantedtalisman":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg1trBPIMzeAWVPXz7SVcqGAj76QnxioNgl1AMRuKYEbmNpgRUOI-le0Z1kzYGLGPhyCRmWwx0FhgtVe01wHJqffph6h_9maV6pepclTdPGq-IsF868nFFUpHLkik0VY_8BBNxS-a1ro6UsmqN6rzrqFMpUJxTmFc5dZGC2sIBzMJxSvZ2IpZE7y1s-8Q/s1920/enhanched-talisman-png.png","name":"Enchanted Talisman","description":"# Enchanted Talisman\nEnchanted Talisman is an equipment item in Mobile Legends that provides magic power, health, and cooldown reduction, as well as regenerating a percentage of the hero's maximum mana every 10 seconds.\n\n## Item Stats\n- **Magic Power**: +50\n- **Health**: +250\n- **Cooldown Reduction**: +20%\n\n## Item Passive\n- **Mana Spring**: Regenerates 15% of the hero's maximum mana every 10 seconds.\n- **Magic Mastery**: Increases the maximum cooldown reduction by 5%.\n\n## Item Tips\n- Enchanted Talisman is best equipped by heroes who can benefit from the mana regeneration and cooldown reduction effects, as well as the magic power and health.\n- Enchanted Talisman can help you spam your skills more frequently and avoid running out of mana, especially if you have skills that have high mana consumption or low cooldowns.\n- Enchanted Talisman can also synergize well with other items that provide magic power or cooldown reduction, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Enchanted Talisman is not very effective against enemies that have high magic resistance or magic damage reduction. In that case, items that provide magic penetration or more damage may be better.\n\n## Item Usage\n- Enchanted Talisman can be used in any game mode where there are enemy heroes that deal low magic damage or have low burst damage.\n- Enchanted Talisman can be purchased early or mid game to increase your magic power and cooldown reduction.\n- Enchanted Talisman can be used by any hero that needs magic power and cooldown reduction, but especially by heroes that have high mana consumption or low cooldown skills, such as Vexana, Valir, Rafaela, Nana, Estes, Chang'e, Aurora etc."},"featherofheaven":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEguazZXUd_V9FnoVRal3Fk4ymiDnw6tZR9Olqy7Wya4wGJn_jfJ225ly2d9F1ypUfu39C3Nc18wnHSgiwA3raAlDliBtUmMsHE8gGj_1yKhbaiA2EJccMBXBwZf4JhNfIfHA646CGRNxKfOBTW7LLO2SmYUm53sGwK_LH14y29kwvXvrqK04992qcUMXA/s1920/feather-of-heaven-png.png","name":"Feather of Heaven","description":"# Feather of Heaven\nFeather of Heaven is an equipment item in Mobile Legends that provides magic power, attack speed, and movement speed, as well as dealing extra magic damage with basic attacks based on the hero's magic power.\n\n## Item Stats\n- **Magic Power**: +65\n- **Attack Speed**: +30%\n- **Movement Speed**: +5%\n\n## Item Passive\n- **Multiplication**: Basic attacks deal extra magic damage equal to 40% of the hero's magic power.\n\n## Item Tips\n- Feather of Heaven is best equipped by heroes who can benefit from the extra magic damage and attack speed effects, as well as the magic power and movement speed.\n- Feather of Heaven can help you deal more damage with your basic attacks, especially if you have skills that enhance your basic attacks or have low cooldowns.\n- Feather of Heaven can also synergize well with other items that provide magic power or attack speed, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Demon Hunter Sword, to increase your damage output and effectiveness.\n- Feather of Heaven is not very effective against enemies that have high magic resistance or magic damage reduction. In that case, items that provide magic penetration or more damage may be better.\n\n## Item Usage\n- Feather of Heaven can be used in any game mode where there are enemy heroes that have low magic defense or low mobility.\n- Feather of Heaven can be purchased mid or late game to increase your magic power and attack speed.\n- Feather of Heaven can be used by any hero that needs magic power and attack speed, but especially by heroes that have enhanced basic attacks or passive effects, such as Silvanna, Esmeralda, Zhask etc."},"fleetingtime":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjhq3SR57wYnIzmAwBzl2yowVjHZaHrjZYNlO2pGuzr4TJpBaJSgNo0v7gmf3o5ybZtt7dtWfvNCWieY7sRmoKj8-ZL69sbQrGhd3FW3XywWsV7wXfz_Tc4H-7Lbt6QTRxB_pkILhzcOSUOiQ5gEhEBG_EJbuqUh54riL71KrI5Rez0GgfY0IsWGVNaaQ/s1920/fleeting-time.png","name":"Fleeting Time","description":"# Fleeting Time\nFleeting Time is an equipment item in Mobile Legends that provides magic power and cooldown reduction, as well as reducing the ultimate cooldown of the hero after killing or assisting an enemy hero.\n\n## Item Stats\n- **Magic Power**: +70\n- **Cooldown Reduction**: +15%\n\n## Item Passive\n- **Time Current**: After killing or assisting, the hero's ultimate cooldown is reduced by 35%.\n\n## Item Tips\n- Fleeting Time is best equipped by heroes who can benefit from the ultimate cooldown reduction effect, as well as the magic power and cooldown reduction.\n- Fleeting Time can help you use your ultimate more frequently and effectively, especially if you have skills that deal high damage or have high impact with your ultimate.\n- Fleeting Time can also synergize well with other items that provide magic power or cooldown reduction, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Fleeting Time is not very effective against enemies that have high magic resistance or magic damage reduction. In that case, items that provide magic penetration or more damage may be better.\n\n## Item Usage\n- Fleeting Time can be used in any game mode where there are enemy heroes that are vulnerable to your ultimate skills.\n- Fleeting Time can be purchased mid or late game to increase your magic power and cooldown reduction.\n- Fleeting Time can be used by any hero that needs magic power and cooldown reduction, but especially by heroes that have high impact ultimates or passive effects, such as Guinevere, Vale, Vexana, Kaja, Kadita, Gusion, Angela etc."},"geniuswand":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgKfDrWklR1vkajIxpXs1C4PzZOTCMiXJC_pp1wETeRQ5VIUt2jnTjPh1e1uOJigBlCm3eFRFf4saqrLWDraCwELvP8EbNQsrsnb6H5BgD0zax4QSIqLZp9QtHXmmdxKqSZE1ZRGbkhmD0QYTg5akLb2Ghc-SVGeXuo0ZclTBeKoXncE2GqY6xCaJ6XjQ/s1920/genius-wand-png.png","name":"Genius Wand","description":"# Genius Wand\nGenius Wand is an equipment item in Mobile Legends that provides magic power, movement speed, and magic penetration, as well as reducing the magic defense of the enemy heroes with each skill damage.\n\n## Item Stats\n- **Magic Power**: +75\n- **Movement Speed**: +5%\n- **Magic Penetration**: +10%\n\n## Item Passive\n- **Magic**: Dealing damage to enemy heroes will reduce their magic defense by 2-9 (scales with level) for 2 seconds. Stacks up to 3 times.\n\n## Item Tips\n- Genius Wand is best equipped by heroes who can benefit from the high magic penetration and magic defense reduction effects, as well as the magic power and movement speed.\n- Genius Wand can help you deal more damage to enemy heroes that have high magic defense or shields, such as Esmeralda, Lolita, Hylos, etc.\n- Genius Wand can also synergize well with other items that provide magic power or magic penetration, such as Holy Crystal, Ice Queen Wand, Glowing Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Genius Wand is not very effective against enemies that have low magic defense or magic damage reduction. In that case, items that provide more damage or cooldown reduction may be better.\n\n## Item Usage\n- Genius Wand can be used in any game mode where there are enemy heroes that have high magic defense or shields.\n- Genius Wand can be purchased mid or late game to increase your magic power and magic penetration.\n- Genius Wand can be used by any hero that needs magic power and magic penetration, but especially by heroes that have multi-stage damage skills or passive effects, such as Silvanna, Zhask, Lunox, Kimmy, Karina, Kadita, Harley, Gord etc."},"glowingwand":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjKEV2jC0Ga0i0zToBqkQG9lK8aTHOItyQoCspXbUKoKFwjr4Zuh0jJsnNL_V_8hRFjwuFuq6GbF7lU74raYvHnEFnMRqJQypUfn9KHxI4SvhKxJkYgBgyYUuvIFLpua5Z5F1lVPgM_PNm4d-_2QZ4kwMIjgyf6mxtq0pmyp-7WsEBiqaLucsjcEHBajA/s1920/glowing-wand-png.png","name":"Glowing Wand","description":"# Glowing Wand\nGlowing Wand is an equipment item in Mobile Legends that provides magic power, health, and movement speed, as well as dealing extra magic damage over time based on the target's current HP with each skill damage.\n\n## Item Stats\n- **Magic Power**: +75\n- **Health**: +400\n- **Movement Speed**: +5%\n\n## Item Passive\n- **Incineration**: Skill damage will burn the targets for 3 seconds, dealing 2%/3%/4% (scales with level) of the target's current HP as magic damage per second. The minimum damage is 10.\n\n## Item Tips\n- Glowing Wand is best equipped by heroes who can benefit from the extra magic damage over time and health effects, as well as the magic power and movement speed.\n- Glowing Wand can help you deal more damage to enemy heroes that have high HP or defenses, such as Hylos, Uranus, Esmeralda etc.\n- Glowing Wand can also synergize well with other items that provide magic power or magic penetration, such as Holy Crystal, Ice Queen Wand, Genius Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Glowing Wand is not very effective against enemies that have low HP or magic damage reduction. In that case, items that provide more damage or cooldown reduction may be better.\n\n## Item Usage\n- Glowing Wand can be used in any game mode where there are enemy heroes that have high HP or defenses.\n- Glowing Wand can be purchased mid or late game to increase your magic power and health.\n- Glowing Wand can be used by any hero that needs magic power and health, but especially by heroes that have continuous damage skills or passive effects, such as Carmilla, Silvanna, Lylia, Faramis, Vexana, Valir, Odette etc."},"holycrystal":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhZStocz1WUAZwP9KG8FgwqvWA8V1_cu12WmgiYLkEJBicZ4cZuOaWHCrf-Ml6_LEJRAr26--DykAuEAY7yNYuozkFZeRwdA19IUgGmm69lz4dCy2OXwZVsFHHFu3KpHq6N7f4NwZbAN63WMLdYn03_6YMpgWce9IEMFmbDnGwGkB7XU9u2IRLVdOk8Ag/s1920/holy-crystal-png.png","name":"Holy Crystal","description":"# Holy Crystal\nHoly Crystal is an equipment item in Mobile Legends that provides a huge boost to magic power and increases the damage of your skills based on your magic power.\n\n## Item Stats\n- **Magic Power**: +90\n- **Unique**: +25% Magic Power\n\n## Item Passive\n- **Exterminate**: After a skill hits a target, the magic power of the next skill damage will be increased by 15%. The effect lasts for 3 seconds and can stack up to 2 times.\n\n## Item Tips\n- Holy Crystal is best equipped by heroes who can deal high burst damage with their skills and need more magic power to amplify their damage output.\n- Holy Crystal can help you deal more damage to enemy heroes that have low HP or magic resistance, such as Layla, Miya, Lesley etc.\n- Holy Crystal can also synergize well with other items that provide magic power or magic penetration, such as Glowing Wand, Ice Queen Wand, Genius Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Holy Crystal is not very effective against enemies that have high HP or magic damage reduction. In that case, items that provide more health or cooldown reduction may be better.\n\n## Item Usage\n- Holy Crystal can be used in any game mode where there are enemy heroes that have low HP or magic resistance.\n- Holy Crystal can be purchased late game to maximize your magic power and burst damage.\n- Holy Crystal can be used by any hero that needs magic power and burst damage, but especially by heroes that have high damage skills or passive effects, such as Eudora, Aurora, Lunox, Pharsa, Kagura, Harley etc.."},"icequeenwand":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh6mt74CSqqsuds8vT_aZvOFS0i5-5lZU2ZO8HQDPUscpOGaSm1HyRBZ1ld8XfaSw8Bl9pe8r6IQKU3RYs3C6INlZF0qAPcvezoOmHvP-e0JPluIZMI2r6kGJApPb0ai748lanqcZVkDxfwOSbdRjUruCFmDIv18FkfMU1j_V8-h_e-ZXFSpCv27pfsiA/s960/ice-queen-wand-png.png","name":"Ice Queen Wand","description":"# Ice Queen Wand\nIce Queen Wand is an equipment item in Mobile Legends that provides magic power, mana, and magic lifesteal, as well as slowing down the enemies with each skill damage.\n\n## Item Stats\n- **Magic Power**: +75\n- **Mana**: +150\n- **Magic Lifesteal**: +10%\n\n## Item Passive\n- **Ice Bound**: Skill damage will slow down the target by 15% for 3 seconds. The effect can stack up to 2 times.\n\n## Item Tips\n- Ice Queen Wand is best equipped by heroes who can benefit from the extra magic lifesteal and slow effects, as well as the magic power and mana.\n- Ice Queen Wand can help you deal more damage to enemy heroes that have high mobility or escape skills, such as Fanny, Ling, Lancelot etc.\n- Ice Queen Wand can also synergize well with other items that provide magic power or magic penetration, such as Holy Crystal, Glowing Wand, Genius Wand, or Divine Glaive, to increase your damage output and effectiveness.\n- Ice Queen Wand is not very effective against enemies that have high magic resistance or crowd control immunity. In that case, items that provide more health or cooldown reduction may be better.\n\n## Item Usage\n- Ice Queen Wand can be used in any game mode where there are enemy heroes that have high mobility or escape skills.\n- Ice Queen Wand can be purchased mid or late game to increase your magic power and magic lifesteal.\n- Ice Queen Wand can be used by any hero that needs magic power and magic lifesteal, but especially by heroes that have continuous damage skills or passive effects, such as Chang'e, Cecilion, Alice, Nana, Vale etc."},"lightningtruncheon":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg9yRILkgzIIvHThOKa-k6XYCqzuXtnm59ksBBFyLPYZyO1sCs14ofEiYQ2yvZOLY2h2wobbSEdh919XsusCWo3DicHwsUTnDZDaVpOUvJnUMj2hSMO7BXF-QlyAUnc3c1ZfbK2O17FUAq3OF-6ZkkyfAMCCCdZYIOIxh5QGDCPL8vxcELlSdV4-ZQFTQ/s1920/lightning-truncheon-png.png","name":"Lightning Truncheon","description":"# Lightning Truncheon\nLightning Truncheon is an equipment item in Mobile Legends that provides magic power, mana, and cooldown reduction, as well as dealing extra magic damage to multiple enemies with each skill damage.\n\n## Item Stats\n- **Magic Power**: +65\n- **Mana**: +300\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Resonate**: Every 6 seconds, the next skill damage will trigger extra magic damage equal to 20% of the user's mana to up to 3 enemies.\n\n## Item Tips\n- Lightning Truncheon is best equipped by heroes who can deal high area damage with their skills and need more magic power and cooldown reduction to spam their skills.\n- Lightning Truncheon can help you deal more damage to enemy heroes that are grouped together or have low HP or magic resistance, such as Bruno, Angela, Rafaela etc.\n- Lightning Truncheon can also synergize well with other items that provide magic power or mana, such as Holy Crystal, Ice Queen Wand, Clock of Destiny, or Blood Wings, to increase your damage output and effectiveness.\n- Lightning Truncheon is not very effective against enemies that have high magic resistance or spread out. In that case, items that provide more health or magic penetration may be better.\n\n## Item Usage\n- Lightning Truncheon can be used in any game mode where there are enemy heroes that are grouped together or have low HP or magic resistance.\n- Lightning Truncheon can be purchased mid or late game to maximize your magic power and cooldown reduction.\n- Lightning Truncheon can be used by any hero that needs magic power and cooldown reduction, but especially by heroes that have high area damage skills or passive effects, such as Eudora, Aurora, Lunox, Pharsa, Kagura, Harley etc."},"necklaceofdurance":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEidPeAmCaU2vxP_akJs8y678amLxvFXkpP7UzYtBe6N0V_Js93vTl-nu73tkXX0jIC-rZJJpPEmAqSJ_fycGl5clfmh3WSMPQ2F3b1LfXcxNIV6vJQoiIx4obcYH7XB5Uf7V6qHgwBtRpxaFXBTvCVxmATyeZz4bfk92qsXhtWxc2__kJVRvIxTkmjf7w/s1920/necklace-of-durance-png.png","name":"Necklace of Durance","description":"# Necklace of Durance\nNecklace of Durance is an equipment item in Mobile Legends that provides magic power, health, and cooldown reduction, as well as reducing the enemies' healing effects with each skill damage.\n\n## Item Stats\n- **Magic Power**: +65\n- **Health**: +300\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Life Drain**: Skill damage will reduce the target's HP regeneration effect by 50% for 3 seconds.\n\n## Item Tips\n- Necklace of Durance is best equipped by heroes who can deal continuous damage with their skills and need more magic power and health to survive longer.\n- Necklace of Durance can help you deal more damage to enemy heroes that have high healing effects or lifesteal, such as Alucard, Ruby, Estes, Uranus, Esmeralda etc.\n- Necklace of Durance can also synergize well with other items that provide magic power or health, such as Holy Crystal, Glowing Wand, Clock of Destiny, or Blood Wings, to increase your damage output and effectiveness.\n- Necklace of Durance is not very effective against enemies that have low healing effects or magic resistance. In that case, items that provide more damage or magic penetration may be better.\n\n## Item Usage\n- Necklace of Durance can be used in any game mode where there are enemy heroes that have high healing effects or lifesteal.\n- Necklace of Durance can be purchased mid or late game to increase your magic power and health.\n- Necklace of Durance can be used by any hero that needs magic power and health, but especially by heroes that have continuous damage skills or passive effects, such as Carmilla, Silvanna, Lylia, Faramis, Vexana, Valir etc."},"shadowtwinblades":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj4t2JggqreoIiwaZc03ouUPLYsPtfT79k1t7uuHuv4KFFXefamwwFJF4OIg5awAeuPCxtDrj-1etnE1t4YUjRp9x_4FPLxzxslutBgwvH4EGWZg77IlJJxpss7ykF6BZr0PBaRe9DwxHTN5HtbcZcYX2RGNUk7C4MeOpWPSQoTpqm72Sgl9IZ-WgmzAQ/s1920/shadow-twindblades-png.png","name":"Shadow Twinblades","description":"# Shadow Twinblades\nShadow Twinblades is an equipment item in Mobile Legends that provides physical attack, attack speed, and critical chance, as well as dealing extra physical damage based on the target's HP with each basic attack.\n\n## Item Stats\n- **Physical Attack**: +40\n- **Attack Speed**: +15%\n- **Critical Chance**: +10%\n\n## Item Passive\n- **Devour**: Basic attacks will deal extra physical damage equal to 5% of the target's current HP. The effect has a 1.5 seconds cooldown.\n\n## Item Tips\n- Shadow Twinblades is best equipped by heroes who can deal high damage with their basic attacks and need more physical attack and critical chance to amplify their damage output.\n- Shadow Twinblades can help you deal more damage to enemy heroes that have high HP or defenses, such as Hylos, Uranus, Esmeralda etc.\n- Shadow Twinblades can also synergize well with other items that provide physical attack or critical damage, such as Berserker's Fury, Scarlet Phantom, Blade of Despair, or Malefic Roar, to increase your damage output and effectiveness.\n- Shadow Twinblades is not very effective against enemies that have low HP or physical damage reduction. In that case, items that provide more lifesteal or penetration may be better.\n\n## Item Usage\n- Shadow Twinblades can be used in any game mode where there are enemy heroes that have high HP or defenses.\n- Shadow Twinblades can be purchased mid or late game to maximize your physical attack and critical chance.\n- Shadow Twinblades can be used by any hero that needs physical attack and critical chance, but especially by heroes that have high damage basic attacks or passive effects, such as Karrie, Claude, Granger, Brody, Wanwan etc."},"wintertruncheon":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjWqMWx8lwRRPJicy5qwPNm0pCegfkhSixB7BxBCTHjCahg5K6xEwU362upj5tJe_sfzb0nMUhb05z81VcI81jzWTR1-vCtg8JldBzrqrLMrHuuU9euTM61qQIWlSa2PDlznpbm3UuyU0dUP-2f_KkxtDcDVj_YVUy_C9UhuRXLsD_Tt0w5khd3g7jxkg/s1920/winter-truncheon-png.png","name":"Winter Truncheon","description":"# Winter Truncheon\nWinter Truncheon is an equipment item in Mobile Legends that provides magic power, armor, and cooldown reduction, as well as allowing you to enter a frozen state and avoid death for a short time.\n\n## Item Stats\n- **Magic Power**: +60\n- **Armor**: +45\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Frozen**: When the user's HP drops below 30%, they can use this item to enter a frozen state for 2 seconds and become immune to all damage and control effects. The effect has a 100 seconds cooldown.\n\n## Item Tips\n- Winter Truncheon is best equipped by heroes who can deal high burst damage with their skills and need more magic power and armor to survive longer.\n- Winter Truncheon can help you avoid death or escape from dangerous situations when your HP is low or when you are being focused by the enemies.\n- Winter Truncheon can also synergize well with other items that provide magic power or cooldown reduction, such as Holy Crystal, Glowing Wand, Ice Queen Wand, or Lightning Truncheon, to increase your damage output and effectiveness.\n- Winter Truncheon is not very effective against enemies that have high burst damage or can wait for you to unfreeze. In that case, items that provide more health or magic resistance may be better.\n\n## Item Usage\n- Winter Truncheon can be used in any game mode where there are enemy heroes that can deal high damage or control effects to you.\n- Winter Truncheon can be purchased mid or late game to increase your magic power and armor.\n- Winter Truncheon can be used by any hero that needs magic power and armor, but especially by heroes that have high burst damage skills or passive effects, such as Eudora, Aurora, Lunox, Pharsa, Kagura, Harley etc."}},"defend":{"antiquecuirass":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiaTcrdUePXJDY3RvkPi7B5LTyPhgVkFtC29kykpI1ppLTJvXwIo49eTeTW_vvtmxukRMKwcVPL09Jy6xy7nxvSyuHuGm9nFof85dCy48hCYu-OBx5abjDLWUfmosvp6Lvxo6IYNpaLQja9Z9XOx-aTc_zWOtnTN-N0Ea-5Ih_qCSZh7a_BmTzMW0yuhA/s1920/antique-cuirass-png.png","name":"Antique Cuirass","description":"# Antique Cuirass\n\n## Item Ability\n\n- **+920 HP**\n- **+2 HP Regen**\n- **+52 Physical Defense**\n\n## Item Passive\n\n- **Deter**: When attacked by an enemy hero's skill, reduces their Physical ATK by 8% for 2s (up to 3 stacks).\n\n## Item Usage\n\n- This item is best employed by Tanks against Physical heroes that rely heavily on their skills to do damage.\n- It is particularly useful in the mid to late game against skill dependent heroes, mostly Fighter and Assassin such as Paquito and Fanny.\n- It can also reduce the damage output of heroes that scale with Physical ATK, such as Miya and Sun.\n- Some of the recommended heroes that can use this item are Khufra, Ruby, Lolita, Hylos, Grock, Franco, Chou, Belerick and Akai."},"athenasshield":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiAKYGc26A7pwoWh9WJrqLpbxCWWg6u9zaPzDdLcIfnIjPRaBDw4VadEd9oZOFKT_HPgTR15XsrcwP02onDniqRc9djfn0SoQINqmoEsiWVXz6CCgQWbZdf1N-mgS-hqyZda4UNo2IPyW8qO_5WU0bWczK9dkExYlwE_n9aIODglYf7cbEab28QJDPVXg/s1920/athena-shield-png.png","name":"Athena's Shield","description":"# Athena's Shield\n\n## Item Ability\n\n- **+900 HP**\n- **+2 HP Regen**\n- **+62 Magic Defense**\n\n## Item Passive\n\n- **Shield**: Can be triggered when taking Magic Damage. Reduces Magic Damage taken by 25% for 5s (including the Magic Damage that triggers this effect). You will be able to trigger this effect again only after leaving combat for 10s.\n\n## Item Usage\n\n- This item is best equipped by heroes to greatly increase their abilities to resist Magic burst damage.\n- It is especially effective against Mages and Magic Damage Fighters such as Eudora, Vale, Phoveus, and others.\n- It can also help Tanks, Fighters, and Supports to safely check bushes even if the enemy has burst mages hiding in them.\n- Some of the recommended heroes that can use this item are Atlas, Carmilla, Baxia, Masha, Terizla, Granger, Badang, Tigreal, Ruby, Martis, Leomord, Lapu-Lapu, Lancelot, Kaja, Johnson, Jawhead, Gatotkaca, Fanny, Diggie, Chou, Aldous and Angela."},"bladearmor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgFENE2x1SD5tybuOt785syxZe287_E33rwjm001wfjzVquLxvIIV39sbYRjqPhIG-uydOMKdYmdocZW33zVWK6Ieu1rUZs0hy0d05ulNpdElQ1iXlJCXwJrC2PsQqs9HySC5lNlDJ1ccrmFiDYmxKKFXs7OnorMG7H4L48kqTkVEgdwOciDKP7rQbQbA/s1920/blade-armor-png.png","name":"Blade Armor","description":"# Blade Armor\nBlade Armor is an equipment item in Mobile Legends that provides high physical defense and damage reflection to counter enemy marksmen and other basic attack reliant heroes.\n\n## Item Stats\n- **Physical Defense**: +90\n- **Crit Damage Reduction**: +20%\n\n## Item Passive\n- **Bladed Armor**: When struck by a basic attack, deals physical damage equal to 25% of the incoming damage (calculated before damage reduction) plus 25% of the hero's physical defense to the attacker and slows them by 15% for 1s.\n\n## Item Tips\n- Blade Armor is best equipped by tanks and fighters who can survive long enough to reflect damage back to the enemy.\n- Blade Armor can also reduce the effectiveness of physical lifesteal and magic lifesteal from basic attacks by lowering the damage dealt and harming the attacker's HP.\n- Blade Armor is not very effective against heroes who deal magic damage with their basic attacks, such as Kimmy or Natan. In that case, Radiant Armor may be a better choice.\n- Blade Armor can be combined with other items that provide physical defense, such as Dominance Ice or Brute Force Breastplate, to increase the damage reflection and survivability.\n\n## Item Usage\n- Blade Armor can be used in any game mode where there are enemy marksmen or basic attack dependent heroes.\n- Blade Armor can be purchased early or mid game to gain an advantage over the enemy's damage output.\n- Blade Armor can be used to initiate fights or protect allies by reflecting damage and slowing down the enemy.\n- Blade Armor can be used to counter heroes such as Miya, Claude, Brody, Roger, Zilong, etc. who rely heavily on basic attacks."},"bruteforcebreastplate":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj-dmBGIcwvF1IPJkCA69g72kawu23YTXp2ErBjRlGn_Dxvfd_bfR9_x7nfia6TvO4-zbTteCLvk7UPXHO0l6DsqQ4I9g3yeLde8VoElivaWVysfWfeZC2fnDSk2X_lOXy8_5iR_zRCQ6QrxLcPALfmAX5Q2xlNTM5w1mUY24cuJK2HmOzj5cHbXhMYNg/s1920/brute-force-breastplate-png.png","name":"Brute Force Breastplate","description":"# Brute Force Breastplate\nBrute Force Breastplate is an equipment item in Mobile Legends that provides high health and physical defense, as well as increasing movement speed and defenses when dealing damage with skills or basic attacks.\n\n## Item Stats\n- **Health**: +770\n- **Physical Defense**: +45\n\n## Item Passive\n- **Brute Force**: Casting a skill or using basic attacks will increase movement speed by 2%, physical and magic defense by 4%. Lasts 4s. Stacks up to 5 times.\n\n## Item Tips\n- Brute Force Breastplate is best equipped by fighters or tanks who can deal damage with skills or basic attacks frequently and benefit from the increased durability and mobility.\n- Brute Force Breastplate can help you chase or escape from enemies by increasing your movement speed when you deal damage to them.\n- Brute Force Breastplate can also increase your physical and magic defense by up to 20% when fully stacked, making you harder to kill by both types of damage.\n- Brute Force Breastplate is not very effective against true damage, which ignores defenses. In that case, items that provide more health or damage reduction may be better.\n\n## Item Usage\n- Brute Force Breastplate can be used in any game mode where there are enemy heroes that deal physical or magic damage.\n- Brute Force Breastplate can be purchased mid or late game to increase your survivability and chasing potential.\n- Brute Force Breastplate can be used by any hero that needs health and physical defense, but especially by heroes that have multi-stage skills or high attack speed, such as Badang, Alucard, Baxia, X.Borg, etc."},"cursedhelmet":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZaE0X4XZsWgQDdM-8dyIGPJJwuyvKUWFsGmY8RtGx-b2gRIh_NplCJlkxlJlJmYG4bLo_cJaxej4_iUqhT_zpbo9VenPAjl7KRSm961J-wFeH84NySn3sYNQBbZjPYUHrM69A7DdKt5q6McbBzxEF1JhE4NvqefcQu6G1qtMfv4vS5qdMF7aGBtoMhg/s1920/cursed-helmet-png.png","name":"Cursed Helmet","description":"\n# Cursed Helmet\nCursed Helmet is an equipment item in Mobile Legends that provides high health and magic defense, as well as dealing magic damage to nearby enemies based on their maximum health.\n\n## Item Stats\n- **Health**: +920\n- **Magic Defense**: +50\n\n## Item Passive\n- **Angry Spirit**: Enemy targets around the hero take 1% + 5% of their maximum HP as magic damage every second. Minions and creeps take 50% extra damage.\n\n## Item Tips\n- Cursed Helmet is best equipped by tanks or fighters who can stay close to the enemy and deal damage with their passive effect.\n- Cursed Helmet can help you clear minion waves faster and harass the enemy laner by dealing damage to them constantly.\n- Cursed Helmet can also deal more damage to enemies with high health, such as other tanks or fighters, making them easier to kill.\n- Cursed Helmet is not very effective against enemies with high magic resistance or magic damage reduction. In that case, items that provide magic penetration or more health may be better.\n\n## Item Usage\n- Cursed Helmet can be used in any game mode where there are enemy heroes that have high health or are clustered together.\n- Cursed Helmet can be purchased mid or late game to increase your survivability and damage output.\n- Cursed Helmet can be used by any hero that needs health and magic defense, but especially by heroes that have high durability and crowd control, such as Baxia, Khufra, Uranus, Tigreal, etc."},"dominanceice":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEixLq5pUzYOOcrmzCl0IOJUsb53cwgt1W_iutO5Y4LXbD0STaRzWjcAf8XG-FQQalGRMUcLkSPoK9NMoqjwOrQWVwvkhGHQkh8WMCQMhhW6J1cxDas4ftE2iMLpgoxcIN7kziNU6VYbcYPYZjci5QfmaGTh9v8DgADoMKEFDCpcbqEM-aTfAGuobJ_mqg/s1920/dominance-ace-png.png","name":"Dominance Ice","description":"\n# Dominance Ice\nDominance Ice is an equipment item in Mobile Legends that provides high physical defense and mana, as well as reducing the shield, HP regen, and attack speed of nearby enemies.\n\n## Item Stats\n- **Physical Defense**: +70\n- **Mana**: +500\n- **Movement Speed**: +5%\n\n## Item Passive\n- **Arctic Cold**: Reduces the shield and HP regen of nearby enemy heroes by 50% (excluding those affected by \"Life Drain\"), and their attack speed by 30%.\n\n## Item Tips\n- Dominance Ice is best equipped by tanks or roamers who can stay close to the enemy and debuff them with their passive effect.\n- Dominance Ice can help you counter enemy heroes that have high shield, HP regen, or attack speed, such as Esmeralda, Balmond, Claude, etc.\n- Dominance Ice can also provide you with more mana and cooldown reduction, which can be useful for heroes that have high mana consumption or skill spamming abilities.\n- Dominance Ice is not very effective against enemies that have high magic damage or magic penetration. In that case, items that provide magic defense or magic damage reduction may be better.\n\n## Item Usage\n- Dominance Ice can be used in any game mode where there are enemy heroes that have high shield, HP regen, or attack speed.\n- Dominance Ice can be purchased mid or late game to increase your survivability and utility.\n- Dominance Ice can be used by any hero that needs physical defense and mana, but especially by heroes that have high durability and crowd control, such as Khufra, Hylos, Gatotkaca, etc.\n"},"guardianhelmet":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjdaenMvSnl5zsWbIm24_zu-wKoT4ClgyXLs9vmIDpfIkr_HfY2PeIBrjyHykN08BlBTJIgcMF_82DP9Se4gpgZq4XpEAWqgkVxulwc_tzdKt5Fb1l7HEnwqcIN5Ks_M6NZ6JV7Lqyrpg4iKBQVStCc95zX1CfmvJq7vNdIvzuyX6kmSqQzVm9cOUfn3g/s1920/guardian-helmet-png.png","name":"Guardian Helmet","description":"# Guardian Helmet\nGuardian Helmet is an equipment item in Mobile Legends that provides high health and health regen, as well as restoring a percentage of the hero's maximum HP every second.\n\n## Item Stats\n- **Health**: +1550\n- **Health Regen**: +100\n\n## Item Passive\n- **Recovery**: Restores 1.5% of the hero's total HP every second. Killing an enemy hero increases this effect by 0.4%, while assisting increases it by 0.2%. This effect lasts for 5 more seconds after the hero takes damage.\n\n## Item Tips\n- Guardian Helmet is best equipped by tanks or fighters who can benefit from the high health and health regen, as well as the passive effect that allows them to recover quickly after a fight.\n- Guardian Helmet can help you sustain longer in the lane and in teamfights, as well as reducing the need to return to base frequently.\n- Guardian Helmet can also synergize well with other items that provide health or health regen, such as Cursed Helmet, Twilight Armor, or Oracle, to increase your durability and survivability.\n- Guardian Helmet is not very effective against enemies that have high burst damage or true damage, which can ignore your health and defenses. In that case, items that provide damage reduction or shields may be better.\n\n## Item Usage\n- Guardian Helmet can be used in any game mode where there are enemy heroes that deal sustained damage or have low burst damage.\n- Guardian Helmet can be purchased mid or late game to increase your health and health regen.\n- Guardian Helmet can be used by any hero that needs health and health regen, but especially by heroes that have high durability and healing abilities, such as Uranus, Minotaur, Lolita, Johnson, etc."},"immortality":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhUn9H07jGDhSbz-rlebGTtcS1-QJ3dFSzHApxcFmd2hBzOzTSdx0qP_XM4AGhd3Rip3bm-GobxqEulka33UEBLf0qxhUJBQSl4jOk7QIa0JVs8Ov0H_BJC4V3sUnyxNdpjUlpzHw48OSjBvb3c7zAresvZdAcM_sDKtDZOPos86-tPuxArMb1SiChXvQ/s1920/immortality-png.png","name":"Immortality","description":"# Immortality\nImmortality is an equipment item in Mobile Legends that provides high health and magic defense, as well as reviving the hero with a shield after death.\n\n## Item Stats\n- **Health**: +800\n- **Magic Defense**: +40\n\n## Item Passive\n- **Immortal**: Revive with a shield that can absorb 15% of the hero's maximum HP and 300-1000 damage 2 seconds after death. The shield lasts for 3 seconds. This effect has a cooldown of 180 seconds.\n\n## Item Tips\n- Immortality is best equipped by heroes who can benefit from the revival effect and the shield, as well as the high health and magic defense.\n- Immortality can help you survive longer in teamfights and avoid being killed by burst damage or crowd control.\n- Immortality can also synergize well with other items that provide health or magic defense, such as Athena's Shield, Oracle, or Cursed Helmet, to increase your durability and survivability.\n- Immortality is not very effective against enemies that have high true damage or damage over time, which can ignore your shield and kill you again. In that case, items that provide damage reduction or healing may be better.\n\n## Item Usage\n- Immortality can be used in any game mode where there are enemy heroes that deal high burst damage or crowd control.\n- Immortality can be purchased late game to increase your health and magic defense.\n- Immortality can be used by any hero that needs health and magic defense, but especially by heroes that have high impact skills or passive effects, such as Atlas, Silvanna, Wanwan, Baxia, Masha, X.Borg, Dyrroth, Granger, Esmeralda, Badang, etc."},"oracle":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiQp9zKqYEYWFiKtCPj8czLFNMtUg30JtFml68NXb608klpSBCgZ3VWUT1aLagjHCVYAIin4kLrlAPEgb31hgYg9nk0qTvxxubOi7WM0VdJtrH07MkEer8QZzolylRWGG2z9m2uA6i6qd41_fLQx-YGzRttxxaA571nGtag_BjSfE_S-jIntY4JaklvNw/s1908/oracle-png.png","name":"Oracle","description":"\n# Oracle\nOracle is an equipment item in Mobile Legends that provides high health and magic defense, as well as increasing the shield absorption and HP regeneration of the hero.\n\n## Item Stats\n- **Health**: +850\n- **Magic Defense**: +42\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Bless**: Increases shield absorption and HP regeneration by 30%.\n\n## Item Tips\n- Oracle is best equipped by heroes who can benefit from the increased shield absorption and HP regeneration, as well as the high health and magic defense.\n- Oracle can help you survive longer in teamfights and recover faster from damage, especially if you have skills or items that provide shields or heals.\n- Oracle can also synergize well with other items that provide health or magic defense, such as Athena's Shield, Cursed Helmet, or Immortality, to increase your durability and survivability.\n- Oracle is not very effective against enemies that have high true damage or damage over time, which can ignore your shields and defenses. In that case, items that provide damage reduction or healing may be better.\n\n## Item Usage\n- Oracle can be used in any game mode where there are enemy heroes that deal high magic damage or crowd control.\n- Oracle can be purchased mid or late game to increase your health and magic defense.\n- Oracle can be used by any hero that needs health and magic defense, but especially by heroes that have strong shield or heal abilities, such as Carmilla, Esmeralda, Hilda, Franco, Belerick, etc."},"queenswings":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAjUtU_eYUkUpC6b8NhaTNYutYZeiM8g8gxV0rixqic-SG38TkkzJnpOMcp22M-jODtn12ibp2iioP2u1uciaPBx60K7EiC2orxsWozfRXFbr1ai-A1-pr8u_JSfd_N5yu86BLFBUkcMi08TIBlvBjiwr_1GMhyFr7znDW12pxynTDcIBsbESLfcAGFA/s1920/queen-wings-png.png","name":"Queen's Wings","description":"# Queen's Wings\nQueen's Wings is an equipment item in Mobile Legends that provides physical attack, health, and cooldown reduction, as well as reducing the damage taken and increasing the spell vamp of the hero when their health is low.\n\n## Item Stats\n- **Physical Attack**: +15\n- **Health**: +1000\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Demonize**: If health is below 40%, it reduces damage taken by 50% and increases spell vamp by 30%. This effect lasts for 5 seconds and has a cooldown of 50 seconds.\n\n## Item Tips\n- Queen's Wings is best equipped by heroes who can benefit from the damage reduction and spell vamp effects, as well as the physical attack, health, and cooldown reduction.\n- Queen's Wings can help you survive longer in teamfights and recover faster from damage, especially if you have skills that deal high damage or have lifesteal effects.\n- Queen's Wings can also synergize well with other items that provide physical attack or health, such as Bloodlust Axe, Endless Battle, or Blade of Despair, to increase your damage output and survivability.\n- Queen's Wings is not very effective against enemies that have high true damage or burst damage, which can ignore your damage reduction and kill you before you can heal. In that case, items that provide damage reduction or shields may be better.\n\n## Item Usage\n- Queen's Wings can be used in any game mode where there are enemy heroes that deal high sustained damage or crowd control.\n- Queen's Wings can be purchased late game to increase your physical attack and health.\n- Queen's Wings can be used by any hero that needs physical attack and health, but especially by heroes that have high damage skills or passive effects, such as Ling, Masha, X.Borg, Dyrroth, Terizla, Esmeralda, Khufra, Guinevere, Uranus, Sun, Leomord, Lapu-Lapu, Lancelot, Jawhead, Helcurt, Hanzo, Belerick, Bane, Aldous (Aulrad), Alpha etc."},"radiantarmor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg-mRvgWg6AQmlf19EohUDEg4PvYo8b1zI2G8yqVe_l0gBMonKW6mQcs5REijsH1YxVdGs5hXpVJxy2T4ZpCUuxm5IrIUc98LzWCZFCdGXMgAnn63Cil8lQanhpd0NnGBAUOX6mrg_tjn7_wNtU4dR1pciBzOeFkJrN81PCxLpix3ke4Dv3XMonrQfadg/s1920/radiant-armor-png.png","name":"Radiant Armor","description":"# Radiant Armor\nRadiant Armor is an equipment item in Mobile Legends that provides high health and magic defense, as well as reducing the magic damage taken by the hero based on their level.\n\n## Item Stats\n- **Health**: +950\n- **HP Regen**: +12\n- **Magic Defense**: +52\n\n## Item Passive\n- **Holy Blessing**: Taking magic damage grants 5-8 magic damage reduction (scales with level) for 3 seconds, capped at 6 stacks.\n\n## Item Tips\n- Radiant Armor is best equipped by heroes who can benefit from the magic damage reduction effect, as well as the high health and magic defense.\n- Radiant Armor can help you counter enemy heroes that deal continuous magic damage over time, such as Alice, Chang'e, Cyclops, Esmeralda, Gord, Guinevere, Harley, Harith, Joy, Julian, Kimmy, Natan, Odette, Silvanna, Valir, Zhask etc.\n- Radiant Armor can also synergize well with other items that provide health or magic defense, such as Athena's Shield, Cursed Helmet, or Oracle, to increase your durability and survivability.\n- Radiant Armor is not very effective against enemies that deal high burst damage or true damage, which can ignore your magic defense and reduction. In that case, items that provide damage reduction or shields may be better.\n\n## Item Usage\n- Radiant Armor can be used in any game mode where there are enemy heroes that deal high magic damage per second or have low cooldown skills.\n- Radiant Armor can be purchased mid or late game to increase your health and magic defense.\n- Radiant Armor can be used by any hero that needs health and magic defense, but especially by heroes that have high durability and crowd control, such as Baxia, Khufra, Uranus, Tigreal etc."},"thunderbelt":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi9gJtftvIZa3o6VJiKYHlXe3nayBso_vQ3_PepMxkMIYy0fgKuangKtJObG6Llp200Q7LgBOp4f9eU85xGAgO_B2eVib1fClTRGnbqZtaViGh_DwsaMOretdLSXPc28gcHnd4yMNYhFL_Ch8c1_Pt6lycrZlPNV3TYKrWQiRkdH2b_0P4opKRWNNMXvw/s1920/thunder-belt-png.png","name":"Thunder Belt","description":"# Thunder Belt\nThunder Belt is an equipment item in Mobile Legends that provides health, mana regen, physical defense, and cooldown reduction, as well as dealing true damage and slowing the enemy with the next basic attack after using a skill.\n\n## Item Stats\n- **Health**: +800\n- **Mana Regen**: +30\n- **Physical Defense**: +40\n- **Cooldown Reduction**: +10%\n\n## Item Passive\n- **Lightning**: In 1.5 seconds after using a skill, the caster's next basic attack will deal true damage equal to 2% of the caster's maximum HP to the enemy target and surrounding units and slow them by 40-80% (increases with the caster's extra max HP) for 1 second. This effect has a 1.5 seconds cooldown.\n\n## Item Tips\n- Thunder Belt is best equipped by heroes who can benefit from the true damage and slow effects, as well as the health, mana regen, physical defense, and cooldown reduction.\n- Thunder Belt can help you deal more damage and crowd control to the enemy, especially if you have skills that have low cooldown or multiple stages.\n- Thunder Belt can also synergize well with other items that provide health or physical defense, such as Dominance Ice, Brute Force Breastplate, or Queen's Wings, to increase your durability and survivability.\n- Thunder Belt is not very effective against enemies that have high damage reduction or shields. In that case, items that provide damage penetration or more damage may be better.\n\n## Item Usage\n- Thunder Belt can be used in any game mode where there are enemy heroes that have high health or defenses.\n- Thunder Belt can be purchased mid or late game to increase your health and physical defense.\n- Thunder Belt can be used by any hero that needs health and physical defense, but especially by heroes that have high damage skills or passive effects, such as Atlas, Minsitthar, Kaja, Aldous (Aulrad), Akai etc.\n"},"twilightarmor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhd7H1Uuj5tKdCpKNtj4ONSarfYOAkHiQg8FTeF3nsn59LAwCJP-gjzsEg3UiRTy8pdHCKQ9BeXlNtv523o7o0kh2wtJE_Ey0V-JKlUcJVFN6PVdVO7kPU2uHF2L1cmvVlLfiKd7S_VUuM680Dq9oVXQgEVBd8ngG4uaSxSuSn12xNihn1cWG1gdDubrg/s1920/twilight-armor-png.png","name":"Twilight Armor","description":"# Twilight Armor\nTwilight Armor is an equipment item in Mobile Legends that provides high health and physical defense, as well as reducing the damage taken by the hero when hit by a single high damage attack.\n\n## Item Stats\n- **Health**: +1200\n- **Physical Defense**: +20\n- **Crit Damage Reduction**: +20%\n\n## Item Passive\n- **Twilight**: When taking more than 600 damage in a single hit, the excess amount will be reduced by 300 +5% of the hero's maximum HP. This effect has a cooldown of 5 seconds.\n\n## Item Tips\n- Twilight Armor is best equipped by heroes who can benefit from the damage reduction effect, as well as the high health and physical defense.\n- Twilight Armor can help you survive against enemy heroes that deal high burst damage or critical damage, such as Eudora, Aldous, Claude, Brody, etc.\n- Twilight Armor can also synergize well with other items that provide health or physical defense, such as Dominance Ice, Brute Force Breastplate, or Queen's Wings, to increase your durability and survivability.\n- Twilight Armor is not very effective against enemies that deal continuous damage or true damage, which can ignore your physical defense and reduction. In that case, items that provide damage reduction or shields may be better.\n\n## Item Usage\n- Twilight Armor can be used in any game mode where there are enemy heroes that deal high burst damage or critical damage.\n- Twilight Armor can be purchased mid or late game to increase your health and physical defense.\n- Twilight Armor can be used by any hero that needs health and physical defense, but especially by heroes that have high durability and crowd control, such as Atlas, Carmilla, X.Borg, Khufra, Minsitthar, Lolita, Johnson etc."}},"movement":{"demonshoes":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjlL7L-iM_Ski503AEtSl7_nIFzLu98XzE5QueJDfhAdAuFyrcw2wZq37VXMIU6U_sLjPaZG424n2SEWowVAlvTu1hWCDBndi6GRoAo_Idfh7vbWZ74SqteuevjsLvKyOQMQD9Oa4eWXItN8b6oBzb7yvgFPT70cQECbxAASuAnVb8Bx48GlWKPQoH80A/s1906/demon-shoes-png-min.png","name":"Demon Shoes","description":"# Demon Shoes\n\nDemon Shoes is a movement item that provides the following benefits:\n\n- +30 mana regen\n- +40 movement speed\n\nIt costs 720 gold and can be built from Boots and two Magic Necklaces.\n\n## Passive Effect\n\nDemon Shoes has a unique passive effect called Mysticism. This effect regenerates the user's mana by 10% when they kill an enemy hero or assist in killing one, and by 4% when they kill a minion.\n\n## Usage\n\nDemon Shoes is a suitable item for magic heroes who need more mana and mobility in the game. It can help them sustain their mana pool and use their skills more often. It can also help them move faster and roam around the map.\n\nDemon Shoes is especially recommended for mage heroes who have high mana consumption or low mana regen, such as Cecilion, Faramis and Odette. It can also be useful for mage heroes who need to farm quickly or gank frequently, such as Lylia, Lunox and Kadita.\n\nHowever, Demon Shoes also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as magic power, cooldown reduction or spell vamp. It also does not increase the user's damage output directly, which can limit their impact in fights. Therefore, it is not recommended for heroes who need more damage or utility in fights.\n\n## Conclusion\n\nDemon Shoes is a simple item that can increase the mana and mobility of magic heroes who use their skills frequently. It is best suited for heroes who need to sustain their mana and roam around the map. However, it also has some risks and limitations that should be considered before buying it."},"magicshoes":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgS_KWG-IFblfGYvHpYg_HUiabYfhCDQgxbHoxMusBmAByyKc6CrL4DifD7Puf78OvLrGiabeE7iN9rVlsIMXvd-r1qt29hrqNoE4YcAtmyUDF5syKVPEZrjFInTjuDeDPsc4ocjhLJZTrwYQew8ANSTegRqGuPpZs6qnKSTpMEOXaZaBBpG8RPZSTmvQ/s1920/magic-shoes-png-min.png","name":"Magic Shoes","description":"# Magic Shoes\n\nMagic Shoes is a movement item that provides the following benefits:\n\n- +10% cooldown reduction\n- +40 movement speed\n\nIt costs 710 gold and can be built from Boots.\n\n## Passive Effect\n\nMagic Shoes has no passive effect, but it has a unique attribute that grants the user +10% cooldown reduction. This attribute reduces the time needed for the user to use their skills again.\n\n## Usage\n\nMagic Shoes is a suitable item for magic heroes who need more mobility and utility in the game. It can help them move faster and rotate between lanes. It can also help them use their skills more often and have more impact in fights.\n\nMagic Shoes is especially recommended for mage heroes who have high cooldowns or rely on their skills to deal damage or support their allies, such as Gusion, Kagura and Estes. It can also be useful for mage heroes who need to escape or chase enemies with their skills, such as Ling, Eudora and Chang'e.\n\nHowever, Magic Shoes also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as magic power, mana regen or spell vamp. It also does not increase the user's damage output directly, which can limit their burst potential against enemies. Therefore, it is not recommended for heroes who need more damage or sustain in fights.\n\n## Conclusion\n\nMagic Shoes is a simple item that can increase the mobility and utility of magic heroes who use their skills frequently. It is best suited for heroes who need to reduce their cooldowns and use their skills more often. However, it also has some risks and limitations that should be considered before buying it."},"rapidboots":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqIveu2tR0zC8q5KnTGHHSwsgcTdnT4bBt5SfR_vG0MQc3hhkFzeng9YO1-gj_JgGuSms4ooSovVyGED21BlBxXnFuEFUFTalmZuTKCEMynRno5m9pUEYYe9r42jdUF34uLHF6hV3KiR66KSr0s7wbhU5S2m0yyGV_baud04o2Bn2vzT8yg2i8HiTTaA/s3840/rapid-boots-png-min.png","name":"Rapid Boots","description":"# Rapid Boots\n\nRapid Boots is a movement item that provides the following benefit:\n\n- +80 movement speed\n\nIt costs 850 gold and can be built from Boots.\n\n## Passive Effect\n\nRapid Boots has a unique passive effect called Side Effect. This effect reduces the user's movement speed by 40 for 5 seconds when they deal or take damage.\n\n## Usage\n\nRapid Boots is a suitable item for heroes who need more mobility and roaming potential in the game. It can help them move faster and cover more distance on the map. It can also help them escape or chase enemies with their high movement speed.\n\nRapid Boots is especially recommended for heroes who have high mobility skills or abilities that can help them avoid damage, such as Hayabusa, Selena and Natalia. It can also be useful for heroes who need to gank, scout or split push frequently, such as Grock, Hanzo and Irithel.\n\nHowever, Rapid Boots also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as attack speed, magic penetration or cooldown reduction. It also reduces the user's movement speed significantly when they engage in combat, which can make them vulnerable or slow them down. Therefore, it is not recommended for heroes who need more combat power or survivability in fights.\n\n## Conclusion\n\nRapid Boots is a simple item that can increase the mobility and roaming potential of heroes who use their movement skills frequently. It is best suited for heroes who need to move around the map and avoid damage. However, it also has some risks and limitations that should be considered before buying it."},"swiftboots":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiLHy31TAOKpPtEpYyJuY7TAPC29dnNFNaQ3oaJpVbpDOMvB6gUCcdTCRsEzRUf28n5wmIR6tOUOQUq99yV9qmUD2OJprph1BbaM2yPvST_Uy3TZAyMN2TpRvTGs979qKBoygdc34blum-mjzMG60O-pIJ0DOZo6HGXdbsIZk1HOkhmzVbZwh84LqoHNQ/s3840/swift-boots-png-min.png","name":"Swift Boots","description":"# Swift Boots\n\nSwift Boots is a movement item that provides the following benefits:\n\n- +15% attack speed\n- +40 movement speed\n\nIt costs 710 gold and can be built from Boots and Knife.\n\n## Passive Effect\n\nSwift Boots has no passive effect, but it has a unique attribute that grants the user +15% attack speed. This attribute increases the frequency of the user's basic attacks.\n\n## Usage\n\nSwift Boots is a suitable item for heroes who need more mobility and attack speed in the game. It can help them move faster and kite or chase enemies. It can also help them deal more damage by hitting more basic attacks.\n\nSwift Boots is especially recommended for marksman heroes who rely on their basic attacks to deal damage, such as Wanwan, Yisunshin and Moskov. It can also be useful for fighter heroes who have high attack speed scaling or abilities that enhance their basic attacks, such as Terizla, Guinevere and Argus.\n\nHowever, Swift Boots also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as physical attack, critical chance or lifesteal. It also does not increase the user's damage output directly, which can limit their burst potential against enemies. Therefore, it is not recommended for heroes who need more damage or sustain in fights.\n\n## Conclusion\n\nSwift Boots is a simple item that can increase the mobility and attack speed of heroes who use their basic attacks frequently. It is best suited for heroes who need to move around and hit more basic attacks. However, it also has some risks and limitations that should be considered before buying it."},"arcaneboots":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgukNML-zRLmG2UZemSASZKqbkOOjZcGhxDQot7Hs65fAcszPTeJ3MHr9wbmgoyxDIdOP3RtrMooJ-umS3rtKtYEemWlJJHStRxBJjWqqCOaB22nXR_OS0PI8Rjma9sdawpy_9RjTMnNZAagC6llZXokYD-kGR9Oa_AiDCjtW9I7OzrAa1Cny8W1NOebw/s3840/arcane-boots-png-min.png","name":"Arcane Boots","description":"\n# Arcane Boots\n\nArcane Boots is a movement item that provides the following benefits:\n\n- +15 magic penetration\n- +40 movement speed\n\nIt costs 690 gold and can be built from Boots.\n\n## Passive Effect\n\nArcane Boots has no passive effect, but it has a unique attribute that grants the user +15 magic penetration. This attribute reduces the magic defense of the enemies that the user hits with their skills or basic attacks.\n\n## Usage\n\nArcane Boots is a suitable item for magic heroes who need more mobility and damage in the game. It can help them move faster and chase or escape from enemies. It can also help them deal more damage by ignoring some of the enemies' magic resistance.\n\nArcane Boots is especially recommended for mage heroes who have high burst or poke potential, such as Harley, Kagura and Lylia. It can also be useful for mage assassins who rely on their skills to execute their targets, such as Selena, Gusion and Karina.\n\nHowever, Arcane Boots also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as cooldown reduction, mana regen or spell vamp. It also does not increase the user's magic power directly, which can limit their damage output against enemies who have high magic defense. Therefore, it is not recommended for heroes who need more utility or sustain in fights.\n\n## Conclusion\n\nArcane Boots is a simple item that can increase the mobility and damage of magic heroes who use their skills frequently. It is best suited for heroes who can burst or poke their enemies with their skills and basic attacks. However, it also has some risks and limitations that should be considered before buying it.\n"},"warriorboots":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgvakXq09-meZ9sm_pRQcUMjQmwy8I4Q56HNW2UgWRqm2m4AkJnqEkz4547xxzQ2ZEZEEKfbyyywwxeAslW6DW_yhrGpXyRjHTJZf3dtkJ2e9CKsQXMQh7iKsTp231UYwca-RaOPnbPdWHcgZvg1tQofY2QYwAKRntnLvZY4HixodSFoFxO-0O-zvMHhg/s1920/warrior-boots-png-min.png","name":"Warrior Boots","description":"# Warrior Boots\n\nWarrior Boots is a movement item that provides the following benefits:\n\n- +22 physical defense\n- +40 movement speed\n\nIt costs 720 gold and can be built from Boots and Leather Jerkin.\n\n## Passive Effect\n\nWarrior Boots has a unique passive effect called Valor. This effect increases the user's physical defense by 5 for 3 seconds when they take basic attack damage, up to a maximum of 25.\n\n## Usage\n\nWarrior Boots is a suitable item for heroes who need more mobility and durability in the game. It can help them move faster and rotate between lanes. It can also help them survive longer by reducing the damage they take from basic attacks.\n\nWarrior Boots is especially recommended for tank and fighter heroes who have to face physical damage enemies in the front line, such as Khufra, Leomord and Zilong. It can also be useful for assassin and marksman heroes who need some extra defense to survive burst damage, such as Lancelot, Granger and Roger.\n\nHowever, Warrior Boots also has some drawbacks. It does not provide any other stats or effects that can benefit the user, such as attack speed, lifesteal or cooldown reduction. It also does not increase the user's damage output directly, which can limit their impact in fights. Therefore, it is not recommended for heroes who need more damage or utility in fights.\n\n## Conclusion\n\nWarrior Boots is a simple item that can increase the mobility and durability of heroes who face physical damage enemies. It is best suited for heroes who need to tank or sustain basic attacks. However, it also has some risks and limitations that should be considered before buying it."},"toughboots":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhD65yeFN5BWc9TYSymEacuACYf90kpu_p02I3ZKID64Itm9lg0fmcS_AXmtlJEETGzwbkGuwgiB42UrFVe2uuXodkl55KAiWieo_JWJsdFZTX5raEGY1rJG_YQfvxpzI4Aw2gPhXwNLz6HQdeQS8h8pp0iroHj2mkUe4_TtUCHN-BpR0VW9Ijx3CBrIQ/s3840/tough-boots-png-min.png","name":"Tough Boots","description":"# Tough Boots\nTough Boots is an equipment item in Mobile Legends that provides magic defense and movement speed, as well as reducing the duration of crowd control effects.\n\n## Item Stats\n- **Magic Defense**: +22\n- **Movement Speed**: +40\n\n## Item Passive\n- **Fortitude**: Reduces time controlled by 30%.\n\n## Item Tips\n- Tough Boots is very useful when facing magic users that have a lot of debilitating effects, such as stuns, slows, silences, etc.\n- Tough Boots can help you escape from dangerous situations or initiate fights by reducing the time you are disabled by the enemy.\n- Tough Boots is not very effective against suppression effects, such as Franco's Bloody Hunt or Kaja's Divine Judgement, or knock-up effects, which cannot be reduced by this item.\n- Tough Boots can be combined with other items that provide magic defense or resilience, such as Athena's Shield or Oracle, to increase your survivability and resistance against magic damage and crowd control.\n\n## Item Usage\n- Tough Boots can be used in any game mode where there are enemy heroes that have a lot of crowd control effects.\n- Tough Boots can be purchased early or mid game to gain an advantage over the enemy's control abilities.\n- Tough Boots can be used by any hero that needs magic defense and movement speed, but especially by tanks and fighters who need to engage or protect their allies.\n- Tough Boots can be used to counter heroes such as Selena, Badang, Moskov, Gloo, Yin, etc. who rely heavily on their crowd control effects."}},"jungling":{"flameretribution":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhZRyqu507Qp2sGnSjxDJ2SJSsRcBzG8QahTZxcxFuP78uamTBrLXa-8ZyfinVxK3BUxShuZ4Jqplu-VwTug53ht7ps_mnURt3BHals3Nq7RPx_o-DUJJTXtqC5_P4-2Iaxek3ZD2vpQXj2ZBKeCqV8bvZngdTaqDs2jvM9mIsufZdHnN__jujfUPAsuQ/s950/flame-retribution-png.png","name":"Flame Retribution","description":"# Flame Retribution\nFlame Retribution is a jungle item in Mobile Legends that enhances the Retribution battle spell and provides physical attack and cooldown reduction.\n\n## Stats\n- **Physical Attack**: +35\n- **Cooldown Reduction**: +10%\n\n## Passive\n- **Retribution**: When the user has the Retribution battle spell, they can use this item to activate a skill that deals 600-1440 true damage (scales with level) to nearby enemies and monsters and slows them by 70% for 3 seconds. The skill has a 45 seconds cooldown.\n\n## Tips\n- Flame Retribution is best equipped by heroes who need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Flame Retribution can help you secure objectives such as Turtle, Lord, or Buffs by dealing true damage and slowing them down.\n- Flame Retribution can also synergize well with other items that provide physical attack or cooldown reduction, such as Blade of Despair, Malefic Roar, Hunter Strike, or Endless Battle, to increase your damage output and effectiveness.\n- Flame Retribution is not very effective against enemies that have low HP or mobility skills. In that case, items that provide more lifesteal or critical chance may be better.\n\n## Usage\n- Flame Retribution can be used in any game mode where you need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Flame Retribution can be purchased early or mid game after upgrading from Jungle Knife.\n- Flame Retribution can be used by any hero that has the Retribution battle spell and needs physical attack and cooldown reduction, but especially by heroes that have high damage skills or passive effects, such as Karrie, Claude, Granger, Brody, Wanwan etc."},"iceretribution":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh7cfQaYgsYdtaVIao3F652pdK2svUdFtRcj_Jo5k2BGOOA_4oYq4mEzCKZbLFHMfpEGQKaAKfg03ENRebmee6Ot6SdfblrWXdd6KAzHGhgXoRXF7Yzvd28IF2C95ngIS9zqPY8o2lRm0kkjgnKunMK77WWxHVxLOurYFK4GSpyQb1oSHtb532rBTmB-Q/s954/ice-retribution-png.png","name":"Ice Retribution","description":"# Ice Retribution\nIce Retribution is a jungle item in Mobile Legends that enhances the Retribution battle spell and provides magic power and cooldown reduction.\n\n## Stats\n- **Magic Power**: +35\n- **Cooldown Reduction**: +10%\n\n## Passive\n- **Retribution**: When the user has the Retribution battle spell, they can use this item to activate a skill that deals 600-1440 true damage (scales with level) to nearby enemies and monsters and freezes them for 1 second. The skill has a 45 seconds cooldown.\n\n## Tips\n- Ice Retribution is best equipped by heroes who need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Ice Retribution can help you secure objectives such as Turtle, Lord, or Buffs by dealing true damage and freezing them.\n- Ice Retribution can also synergize well with other items that provide magic power or cooldown reduction, such as Holy Crystal, Glowing Wand, Ice Queen Wand, or Lightning Truncheon, to increase your damage output and effectiveness.\n- Ice Retribution is not very effective against enemies that have low HP or crowd control immunity. In that case, items that provide more health or magic penetration may be better.\n\n## Usage\n- Ice Retribution can be used in any game mode where you need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Ice Retribution can be purchased early or mid game after upgrading from Jungle Knife.\n- Ice Retribution can be used by any hero that has the Retribution battle spell and needs magic power and cooldown reduction, but especially by heroes that have high damage skills or passive effects, such as Eudora, Aurora, Lunox, Pharsa, Kagura, Harley etc."},"bloodyretribution":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEio_yb5PZUe5jORwnKgLO9Kxj1aBsTjHVIUUBiuswevA3zl5XvpOX8vxxIFz4p2KE8nlX2CpltaxJzFU-xnstn3SaN18DF3ExWa7fxbQe9qXXC5TnXYh-fuQER1Er-4wULL7CwbFuFvoAcsViq864dzHs7HrlnX8FxoRPnwCmswFAs-qRX0c5Wl6iMm7Q/s960/bloody-retribution-png.png","name":"Bloody Retribution","description":"# Bloody Retribution\nBloody Retribution is a jungle item in Mobile Legends that enhances the Retribution battle spell and provides physical attack and lifesteal.\n\n## Stats\n- **Physical Attack**: +35\n- **Lifesteal**: +10%\n\n## Passive\n- **Retribution**: When the user has the Retribution battle spell, they can use this item to activate a skill that deals 600-1440 true damage (scales with level) to nearby enemies and monsters and heals the user for 50% of the damage dealt. The skill has a 45 seconds cooldown.\n\n## Tips\n- Bloody Retribution is best equipped by heroes who need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Bloody Retribution can help you secure objectives such as Turtle, Lord, or Buffs by dealing true damage and healing yourself.\n- Bloody Retribution can also synergize well with other items that provide physical attack or lifesteal, such as Blade of Despair, Malefic Roar, Hunter Strike, or Endless Battle, to increase your damage output and effectiveness.\n- Bloody Retribution is not very effective against enemies that have low HP or physical damage reduction. In that case, items that provide more critical chance or penetration may be better.\n\n## Usage\n- Bloody Retribution can be used in any game mode where you need to farm faster in the jungle and deal more damage to enemies and monsters with high HP or defenses.\n- Bloody Retribution can be purchased early or mid game after upgrading from Jungle Knife.\n- Bloody Retribution can be used by any hero that has the Retribution battle spell and needs physical attack and lifesteal, but especially by heroes that have high damage basic attacks or passive effects, such as Karrie, Claude, Granger, Brody, Wanwan etc."}},"roaming":{"encourage":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhJLxs7Gs4gxgZcVNqsnGcqIIgNAERkrbL0jG_nd9L7K_xwtKeWHLe4b4y1vF75Q6364MbOS3XNwBzjHxzgrmeg-31mFYwojqbf1CNhfPFqGUVyXW9IyyB1JCXtiNSLjB0xl7Snyo-LCbQQH7FXuewCriSu1kREEGVDwpcjOJwXNN5kcPWGkfw3Js8yRg/s1920/passive-encourage-png.png","name":"Encourage","description":"# Encourage\nEncourage is a battle spell in Mobile Legends that allows you and your nearby allies to increase your physical and magic attack for a short time.\n\n## Spell Stats\n- **Cooldown**: 60 seconds\n- **Mana Cost**: 0\n\n## Spell Effect\n- **Encourage**: After 1.5 seconds of channeling, you and your nearby allies will increase your physical and magic attack by 10% for 5 seconds.\n\n## Spell Tips\n- Encourage is best used by heroes who can benefit from the physical and magic attack effects, such as fighters, marksmen, or mages.\n- Encourage can help you deal more damage to your enemies in team fights or when taking objectives such as Turtle, Lord, or Turrets.\n- Encourage can also synergize well with other spells or items that provide physical or magic attack, such as Inspire, Awe Mask, Blade of Despair, or Holy Crystal, to increase your damage output and effectiveness.\n- Encourage is not very effective against enemies that have high defenses or damage reduction. In that case, spells that provide more penetration or crowd control may be better.\n\n## Spell Usage\n- Encourage can be used in any game mode where you need to deal more damage to your enemies in team fights or when taking objectives.\n- Encourage can be activated before engaging in a fight or when attacking an objective.\n- Encourage can be used by any hero that needs physical or magic attack, but especially by heroes that have high damage skills or passive effects, such as Aldous, Roger, Karrie, Lunox, Pharsa etc."},"conceal":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1_bWkbbTMroIl3OJotmiuFK12DpgsmO0v8HEwBXUDOboqNAT7ojHX8RQ-ItG4K_H2gT5WWPEHSEWxwh421ZXlEOy7-QcNmJFEhSPIypU4YcA-XY1A1B6hmXhkN4nOViO_-xNJQBLf_lwjOFKwN8i-y9wGcIUo3QDdRPUhm1eT1-jmsGShz2--O6qPVg/s1920/active-conceal-png.png","name":"Conceal","description":"# Conceal\nConceal is a battle spell in Mobile Legends that allows you and your nearby allies to enter a stealth mode and increase your movement speed for a short time.\n\n## Spell Stats\n- **Cooldown**: 80 seconds\n- **Mana Cost**: 0\n\n## Spell Effect\n- **Conceal**: After 1.5 seconds of channeling, you and your nearby allies will enter a stealth mode for 5 seconds and increase your movement speed by 30%. The stealth mode will be broken if you or your allies deal or take damage.\n\n## Spell Tips\n- Conceal is best used by heroes who can benefit from the stealth and movement speed effects, such as assassins, marksmen, or mages.\n- Conceal can help you surprise your enemies with unexpected attacks or escape from dangerous situations when you are being chased or ganked.\n- Conceal can also synergize well with other spells or items that provide stealth or movement speed, such as Sprint, Awe Mask, Windtalker, or Shadow Mask, to increase your mobility and survivability.\n- Conceal is not very effective against enemies that have vision or detection skills or items, such as Selena, Yi Sun-Shin, Oracle, or Twilight Armor. In that case, spells that provide more damage or crowd control may be better.\n\n## Spell Usage\n- Conceal can be used in any game mode where you need to surprise your enemies with unexpected attacks or escape from dangerous situations.\n- Conceal can be activated before engaging in a fight or when you are being chased or ganked.\n- Conceal can be used by any hero that needs stealth and movement speed, but especially by heroes that have high burst damage or mobility skills, such as Natalia, Lancelot, Gusion, Hayabusa, Helcurt etc."},"favor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhz37zyleSHDSHwNji2nwQ6mcCndf6ZhzJdpjzkzKPKAILt1GcQikk5sbhwuBq2tTYfgTnsRyALvXi82wTxq2xWFHWsjswSHJCWd4CDYifuAVq3NTFPuSrphu2w9eQJPxwWlElUnVZFe-qjhbjMOCrUFIFALrsXkIPpCoSiGdn9Ceo4a-bvQdob8y7__A/s1896/passive-flavor-png.png","name":"Favor","description":"# Favor\nFavor is a battle spell in Mobile Legends that allows you and your nearby allies to heal for a percentage of your max HP.\n\n## Spell Stats\n- **Cooldown**: 120 seconds\n- **Mana Cost**: 0\n\n## Spell Effect\n- **Favor**: After 1.5 seconds of channeling, you and your nearby allies will heal for 10% of your max HP.\n\n## Spell Tips\n- Favor is best used by heroes who can benefit from the healing effects, such as tanks, fighters, or supports.\n- Favor can help you survive longer in team fights or when taking damage from enemies or monsters.\n- Favor can also synergize well with other spells or items that provide healing or max HP, such as Heal, Awe Mask, Oracle, or Blood Wings, to increase your survivability and effectiveness.\n- Favor is not very effective against enemies that have high burst damage or healing reduction. In that case, spells that provide more damage or crowd control may be better.\n\n## Spell Usage\n- Favor can be used in any game mode where you need to survive longer in team fights or when taking damage from enemies or monsters.\n- Favor can be activated when your HP is low or when you are being focused by the enemies.\n- Favor can be used by any hero that needs healing or max HP, but especially by heroes that have high durability or supportive skills, such as Hylos, Uranus, Esmeralda, Estes, Rafaela etc."},"direhit":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2LdZy9c8urGX7kaYtgaDYbNheAUoSvA2O3RM2Kp91R3LvWUlaB3VdLwpVREYWoyV7Ur1GCO-9oduqJqKZIKThlyUle7JsB94hgCWUwW0iw_em0E0bZk6ulJvIG2RVtFfVbkN1BWmVu_DGlxUB74GqazlB8ZAFBACMWDX8P3wzKtosPAcWoDg_brTqvg/s1909/passsive-dire-hit-png.png","name":"Dire Hit","description":"# Dire Hit\nDire Hit is a battle spell in Mobile Legends that allows you to increase your critical chance and critical damage for a short time.\n\n## Spell Stats\n- **Cooldown**: 60 seconds\n- **Mana Cost**: 0\n\n## Spell Effect\n- **Dire Hit**: After 1.5 seconds of channeling, you will increase your critical chance by 20% and your critical damage by 40% for 5 seconds.\n\n## Spell Tips\n- Dire Hit is best used by heroes who can deal high damage with their basic attacks and need more critical chance and critical damage to amplify their damage output.\n- Dire Hit can help you deal more damage to enemy heroes that have low HP or defenses, such as Layla, Miya, Lesley etc.\n- Dire Hit can also synergize well with other spells or items that provide critical chance or critical damage, such as Inspire, Awe Mask, Berserker's Fury, or Scarlet Phantom, to increase your damage output and effectiveness.\n- Dire Hit is not very effective against enemies that have high HP or physical damage reduction. In that case, spells that provide more lifesteal or penetration may be better.\n\n## Spell Usage\n- Dire Hit can be used in any game mode where you need to deal more damage to enemy heroes with low HP or defenses.\n- Dire Hit can be activated before engaging in a fight or when attacking an enemy hero.\n- Dire Hit can be used by any hero that needs critical chance and critical damage, but especially by heroes that have high damage basic attacks or passive effects, such as Natalie, Roger, Granger, Brody, Wanwan, Bruno etc."}}}

