{"attack":{"berserkersfury":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEifeHuJiHoM5ciuVS1ByFwqqnWsPwW49y-EfOcttB9UxkklxkrprnvArLzxMRnA5_P_IHvNblFTKsfi2uENpnxtGMomzVpGvQqwcpxEf2JWbbXsGnomyjXaEGcxREiH6Ov5RW_YDl90LWO9iVl-HoKKwpCBWWWFeoLeS1iOzmFt_2bmvTpjeMz3KjcPIA/s1920/bersekers-fury-png.png","name":"Berserker’s Fury","description":"\\n**Berserker’s Fury**\\n\\nBerserker’s Fury is an attack item that provides the following bonuses:\\n\\n- +65 physical attack\\n- +25% critical chance\\n\\nIn addition, it possesses a unique attribute:\\n\\n- Increases critical damage by 40%\\n\\nFurthermore, it has a unique passive:\\n\\n- Grants 5% extra physical attack for 2 seconds after a critical strike1\\n\\nThis item is particularly well-suited for physical heroes who heavily rely on critical damage, including Ling, Granger, Lesley, and Moskov2.\\n\\nBerserker’s Fury can be obtained at the cost of 2250 gold and can be upgraded from the combination of Legion Sword and Javelin."},"bladeof despair":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgclT6Qn7HBApbgkwoGp5-S07eWofYmCT3boRwXndA3wx9PlgU1jQR22Izft-sF-30-7zAzTXnxcj7AjFKBy3qAI0NzJ63mFU8ymAEvRWXkDLtBDiiR-iN6ylmf0B7kqPMcIejlwR5vJlNiFgRAKlKCLyC4vWaRtYNrCnQlp-GhkbDRjhG8zNKHm-jmcQ/s960/blade-of-despair-png.png","name":"Blade of Despair","description":"**Blade of Despair**\\n\\nBlade of Despair is a powerful item with the following attributes:\\n\\n- +160 Physical Attack\\n- +5% Movement Speed\\n\\nIt possesses a unique passive called \\\"Despair\\\" with the following effect:\\n\\n- Attacking enemies below 50% HP grants 25% extra Physical Attack for 2 seconds (this bonus is applied before dealing damage).\\n\\nBlade of Despair is considered one of the most potent items in the game due to its high boost in physical attack, surpassing any other equipment12. It is particularly effective for physical heroes whose skills scale well in the later stages of the game. However, it is generally not recommended to purchase this item during the early to middle phases of a match1. \\n\\nSeveral heroes can greatly benefit from Blade of Despair, including Wanwan, Ling, Granger, Lancelot, Helcurt, and Claude. These heroes have abilities that synergize well with the increased physical attack and can make optimal use of the item's potential."},"bladeof heptaseas":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhYm_yalQv9R3N1TYC3tTGE-SXXMzdrWM5cGRUxSioCMJhbz4S30NgDwq3Js-5uiGL-RIP621n9XzDpGnQbjGFavx2x4NCH-RlCLV08tu_78VswhdidEV5OLuyxPNGXiEmXpzi2axt-XnXmyMA9zf7_r5OzJCbULE3yCOrhLpbI2R0xPqaoKlAkduA-Cw/s960/blade-of-heptaseas-png.png","name":"Blade of Heptaseas","description":"**Blade of Heptaseas**\\n\\nBlade of Heptaseas is an item that provides the following bonuses:\\n\\n• +250 HP\\n• +70 Physical ATK\\n• +15 Physical PEN\\n\\nIt features a unique passive called \\\"Ambush\\\" with the following effect:\\n\\n- If no damage is taken or dealt within 5 seconds, the next Basic Attack will deal extra Physical Damage equal to 160 plus 40% of Physical Attack. Additionally, it inflicts a 40% slow effect on the target for 1.5 seconds.\\n\\nBlade of Heptaseas is a valuable item for physical assassins who require increased damage output and improved crowd control abilities1. Additionally, when using a skill, it reduces the target's physical defense by 25 points for 3 seconds2. \\n\\nSeveral heroes can greatly benefit from Blade of Heptaseas, including Ling, Saber, Lancelot, Hayabusa, and Fanny. These heroes can take advantage of the item's bonuses and unique effects to enhance their damage potential and control over the battlefield."}},"mage":{},"defend":{}}

