{"attack":{"berserkersfury":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEifeHuJiHoM5ciuVS1ByFwqqnWsPwW49y-EfOcttB9UxkklxkrprnvArLzxMRnA5_P_IHvNblFTKsfi2uENpnxtGMomzVpGvQqwcpxEf2JWbbXsGnomyjXaEGcxREiH6Ov5RW_YDl90LWO9iVl-HoKKwpCBWWWFeoLeS1iOzmFt_2bmvTpjeMz3KjcPIA/s1920/bersekers-fury-png.png","name":"Berserker’s Fury","description":"\\n**Berserker’s Fury**\\n\\nBerserker’s Fury is an attack item that provides the following bonuses:\\n\\n- +65 physical attack\\n- +25% critical chance\\n\\nIn addition, it possesses a unique attribute:\\n\\n- Increases critical damage by 40%\\n\\nFurthermore, it has a unique passive:\\n\\n- Grants 5% extra physical attack for 2 seconds after a critical strike1\\n\\nThis item is particularly well-suited for physical heroes who heavily rely on critical damage, including Ling, Granger, Lesley, and Moskov2.\\n\\nBerserker’s Fury can be obtained at the cost of 2250 gold and can be upgraded from the combination of Legion Sword and Javelin."},"bladeof despair":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgclT6Qn7HBApbgkwoGp5-S07eWofYmCT3boRwXndA3wx9PlgU1jQR22Izft-sF-30-7zAzTXnxcj7AjFKBy3qAI0NzJ63mFU8ymAEvRWXkDLtBDiiR-iN6ylmf0B7kqPMcIejlwR5vJlNiFgRAKlKCLyC4vWaRtYNrCnQlp-GhkbDRjhG8zNKHm-jmcQ/s960/blade-of-despair-png.png","name":"Blade of Despair","description":"**Blade of Despair**\\n\\nBlade of Despair is a powerful item with the following attributes:\\n\\n- +160 Physical Attack\\n- +5% Movement Speed\\n\\nIt possesses a unique passive called \\\"Despair\\\" with the following effect:\\n\\n- Attacking enemies below 50% HP grants 25% extra Physical Attack for 2 seconds (this bonus is applied before dealing damage).\\n\\nBlade of Despair is considered one of the most potent items in the game due to its high boost in physical attack, surpassing any other equipment12. It is particularly effective for physical heroes whose skills scale well in the later stages of the game. However, it is generally not recommended to purchase this item during the early to middle phases of a match1. \\n\\nSeveral heroes can greatly benefit from Blade of Despair, including Wanwan, Ling, Granger, Lancelot, Helcurt, and Claude. These heroes have abilities that synergize well with the increased physical attack and can make optimal use of the item's potential."},"bladeof heptaseas":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhYm_yalQv9R3N1TYC3tTGE-SXXMzdrWM5cGRUxSioCMJhbz4S30NgDwq3Js-5uiGL-RIP621n9XzDpGnQbjGFavx2x4NCH-RlCLV08tu_78VswhdidEV5OLuyxPNGXiEmXpzi2axt-XnXmyMA9zf7_r5OzJCbULE3yCOrhLpbI2R0xPqaoKlAkduA-Cw/s960/blade-of-heptaseas-png.png","name":"Blade of Heptaseas","description":"**Blade of Heptaseas**\\n\\nBlade of Heptaseas is an item that provides the following bonuses:\\n\\n• +250 HP\\n• +70 Physical ATK\\n• +15 Physical PEN\\n\\nIt features a unique passive called \\\"Ambush\\\" with the following effect:\\n\\n- If no damage is taken or dealt within 5 seconds, the next Basic Attack will deal extra Physical Damage equal to 160 plus 40% of Physical Attack. Additionally, it inflicts a 40% slow effect on the target for 1.5 seconds.\\n\\nBlade of Heptaseas is a valuable item for physical assassins who require increased damage output and improved crowd control abilities1. Additionally, when using a skill, it reduces the target's physical defense by 25 points for 3 seconds2. \\n\\nSeveral heroes can greatly benefit from Blade of Heptaseas, including Ling, Saber, Lancelot, Hayabusa, and Fanny. These heroes can take advantage of the item's bonuses and unique effects to enhance their damage potential and control over the battlefield."},"bloodlustaxe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhAT9a_lM9f-rnxKP81ds7LbN5r9j0_5KEMo4fHGCxHmcdaNAWP4XBj7spw5v6g3D1A_dkKnxwDQnTi5OdR-Ll_7BAlKYFfKsEp-ksqBIf0Tx9iwKxFOVdhJtgLUa_gHSyNUQRp7aXER_GccdBok47yh6fchUHmaa_n2jYjG6gK1obN5Q9ZNvQk7NzBHw/s960/blood-axe-png.png","name":"Bloodlust Axe","description":"**Bloodlust Axe**\n\nBloodlust Axe is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +10% Cooldown Reduction\n• Unique: +20% Spell Vamp\n\nThis item proves to be highly valuable for fighters or assassins who heavily rely on their skills to deal damage, as it enhances their survivability while dealing significant damage1. It allows them to recover a percentage of the damage dealt by their skills as health2.\n\nSeveral heroes can greatly benefit from Bloodlust Axe, including X.Borg, Dyrroth, Terizla, Granger, Leomord, and Fanny2. These heroes possess skills that synergize well with the item's effects, enabling them to sustain themselves in battles and stay in the fight longer."},"corrosionscythe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgpKivIV6uE0lXqWofeGHTATmLG0kS-3UPS4oP6d1R4Ai30_UXqOATty4ihlTlT6BKImcuLKzUNgoePD7SkQQp2CAPmQMjO13TjCApeExBal8QX__2DlPZ-AfEPpzD6iLYZxuKsn_lvoTcuzel5PwTDTHHEh-WdRmEads4I-x8-yBkbh-U-db5qXDj8Pw/s1920/corrosion-scythe.png","name":"Corrosion Scythe","description":"Corrosion Scythe\n\nCorrosion Scythe is an item that provides the following bonuses:\n\n+50 Physical ATK\n+25% Attack Speed\n+5% Movement SPD\nThis item has two unique passives that enhance your basic attacks. The first one is Distortion, which gives your basic attacks a chance to slow down the enemy’s movement speed by 50% for melee attacks or 20% for ranged attacks1. The second one is Impulse, which increases your attack damage by 8% each time you deal damage with your basic attacks. This effect can stack up to 5 times and lasts for 3 seconds.\n\nThis item is ideal for heroes who rely on their attack speed and basic attacks to deal damage, such as Wanwan, Masha, Sun, Hanzo, Claude, and Miya. These heroes can use Corrosion Scythe to chase down their enemies, kite them, and deal more damage over time."},"demonhunter sword":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi0QBNKZEa9F_eBJTCVn70ibELuqkyF0SM3mQjQbbKBWc3ISVQsr_j0xAcKKNXQ-2IGfvnCFV72mWnSWQXqllXlkmGmXzDz6wgoPp5tlTf1NVwbh4pkDLh_lhpk3ARSahI1lA-DPpvvyqzm-eL_Ai4nFP2-uBw1_mYuKHnf4nGsuR7hIvtjK1uT8ITnFg/s1920/demon-hunter-sword-png.png","name":"Demon Hunter Sword","description":"Demon Hunter Sword\n\nDemon Hunter Sword is an item that provides the following bonuses:\n\n+35 Physical ATK\n+25% Attack Speed\nThis item has two unique passives that boost your damage output. The first one is Devour, which makes your basic attacks deal 9% of the target’s current HP as additional physical damage (up to 60 against creeps and minions)1. The second one is Licking Swallow, which grants you 4% Physical Lifesteal for each basic attack for 3 seconds. This effect can stack up to 5 times.\n\nThis item is ideal for heroes who want to counter tanks and heroes with high HP, such as Wanwan, Masha, Badang, Sun, Natalia, Lesley, Layla, Helcurt, Hanabi, Claude, Bruno, and Argus. These heroes can use Demon Hunter Sword to deal more damage based on the enemy’s HP and heal themselves with their basic attacks."},"endlessbattle":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjLu7hJ4BG2S0dWD0J6xpd7v9MMRMVwSZySNdSYIiaRFpniG4Tn9SRUH3CCV3la302vOaYVTApCs2zdPlroqN09PQun8rEV6oSofkma9qahGY_fKJtcA3gBZE1n7efK0YTuobXcwYmJOd75MzzaKa8zTGf0rpmLPcqpIFpwvIn17uSJuhSGuqQHYvG-pA/s1920/endless-battle-png.png","name":"Endless Battle","description":"**Endless Battle**\n\nEndless Battle is an item that provides the following bonuses:\n\n• +65 Physical ATK\n• +25 Mana Regen\n• +250 HP\n• +10% Cooldown Reduction\n• +5% Movement Speed\n• +15% Physical Lifesteal\n\nThis item has two unique passives that enhance your damage and mobility. The first one is **Divine Justice**, which makes your first basic attack after using a skill deal 85% additional physical and true damage. This effect has a cooldown of 1.5 seconds¹. The second one is **Chase Fate**, which increases your movement speed by 10% when the Divine Justice effect is triggered¹.\n\nThis item is ideal for physical heroes who use skills and basic attacks in combination, such as Popol, Ling, X.Borg, Dyrroth, Terizla, Granger, Saber, Ruby, Roger, Natalia, Moskov, Martis, Lesley, Leomord, Lapu-Lapu, Lancelot, Jawhead, Irithel, Hayabusa, Hanzo, Claude, Clint, Bane, Aldous (Aulrad), Alucard and Alpha². These heroes can use Endless Battle to deal more damage with their basic attacks and chase down their enemies with increased movement speed³.\n"},"goldenstaff":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbdcGur8bxvCHeuojnPsRGKvuzdBS2iFxkIWSVorLD_yJoTstFQI4JtSuyFDboTFZ4CYnEVhIUAjNr9dGXXc_6ZNYlaGfl29jObEp_YtYEvyiUyKGfO_Hr8eNTbjyx3yFAsqfw4gDtInTRkGYruml5k4K05c_UI-SgMX-Izs_pxidlQikTBKrpNmNJ_g/s1920/golden-staff-png.png","name":"Golden Staff","description":"**Golden Staff**\n\nGolden Staff is an item that provides the following bonuses:\n\n• +65 Physical ATK\n• +30% Attack Speed\n\nThis item has two unique passives that boost your attack speed and damage. The first one is **Swift**, which makes you unable to increase your critical chance, but increases your attack speed by 1% for every 1% critical chance you have. The second one is **Endless Strike**, which makes your basic attacks add an infinite stack of hits. After 2 stacks have accumulated, the next basic attack is triggered 3 times.\n\nThis item is ideal for heroes who have skills or passives that can trigger the effect of their basic attacks multiple times, such as Popol, Badang, Claude, Karrie, and Miya. These heroes can use Golden Staff to deal more damage with their basic attacks and increase their attack speed without relying on critical chance.\n\n"},"haassclaws":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqrPaAMBgEx1SmA8f8Bbgi3253Dp9-tZKPj0sRPKU4mNZGNFyLrSrAhfK9CDlPpAX91fo-rjWN1q7r3Ec4Jj7v0xsoJFtKsq48sWojwt2F3XAw60F8jyLUxjOrgabHeTTeoOWcIIuIVKjN6P7XIu2h0hnvZc1K112n_vSStas-XqEWahXnLrjsNiuyAw/s1920/haas-claw-png.png","name":"Haas's Claws","description":"**Haas's Claws**\n\nHaas's Claws is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +25% Physical Lifesteal\n\nThis item has a unique passive that increases your survivability when your HP is low. The passive is **Insanity**, which grants you an extra 15% Physical Lifesteal when your HP drops below 50%.\n\nThis item is ideal for heroes who want to sustain themselves in fights with their basic attacks, such as Zilong, Yisunshin, Ruby, Moskov, Layla, Hanabi, Freya, Clint, Argus, Alucard and Miya. These heroes can use Haas's Claws to heal themselves by dealing damage and stay longer in battles."},"hunterstrike":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjjepr5MMzNDnyfjRyMy74pGt2j-vAVWDd3lLn7ftIjQRGBqPFesqyEbzi2jE6bQ9VKNg9dsgLBza1eMRTLr6QOf6dEzOY4Ed9GP-7GO5G2y52UJk2HTPlLQgvkOVxoQ0CwB4HiWyi4JQVAS_890V1ughoUceRcmML00uI5t4cz0s1TSXL-ucu5A3V_AQ/s955/hunter-strike-png.png","name":"Hunter Strike","description":"**Hunter Strike**\n\nHunter Strike is an item that provides the following bonuses:\n\n• +100 Physical ATK\n• +10% Cooldown Reduction\n\nThis item has a unique passive that increases your movement speed when you attack the enemy multiple times. The passive is **Hunt**, which increases your movement speed by 30% for 2 seconds when you attack the enemy 5 times in a row. This effect has a cooldown of 15 seconds.\n\nThis item is ideal for heroes who are physical assassins that need to deal more damage and increase their mobility, such as Jawhead, Hilda, Lancelot, Hayabusa, Helcurt, Natalia, and Saber. These heroes can use Hunter Strike to chase down their targets and escape from danger with increased movement speed."},"maleficroar":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiTTHjEv4XDzR59kaoF91lTeYOwvod4kAF82BeLHFI3PpVC1mHub_0xIDLMlz52-yYga1t2YeyeV7bVGqXWQ8Vp4QJQt3X5snoVHaYERnMCNHHbXb4FHLqACWJEgtnDo57CPALS-8N8_Jry-0wwxVbNZpCMXJeIoinRCfAmIxUsOUTJpwphs-tf7DcWwg/s1903/malefic-roar-png.png","name":"Malefic Roar","description":"**Malefic Roar**\n\nMalefic Roar is an item that provides the following bonuses:\n\n• +60 Physical ATK\n• +35% Physical Penetration\n\nThis item has a unique passive that increases your damage against enemies with high physical defense. The passive is **Armor Buster**, which increases your physical penetration by 0.05% for each point of the enemy's physical defense when you deal damage to them, capped at 20%.\n\nThis item is ideal for heroes who want to counter enemy heroes or turrets that have high physical defense, such as Yisunshin, Saber, Lesley, Clint, Bruno and Zilong. These heroes can use Malefic Roar to deal more damage with their basic attacks and skills and destroy turrets faster."},"rosegold meteor":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxL44vyipJkxjpWluAcWxFKK-eZQOfoBzAH-1g4ZMWjekDRcXD3Z6NRfh1AtJj-sWYox1JBiZl0aB62W4OGB_ufuCYFg7cGKgUVtI8Qh4LA5uWUsEI0Q40DsOwSQJhfqXAWnEoS6Kl6xhSDEfUs9e8eLPDzvaALiYiquGH1cxtboyU4kmGCqbSicaMCA/s960/rose-gold-meteor-png.png","name":"Rose Gold Meteor","description":"**Rose Gold Meteor**\n\nRose Gold Meteor is an item that provides the following bonuses:\n\n- +60 Physical ATK\n- +30 Magic Resistance\n- +5% Physical Lifesteal\n\nThis item has a unique passive that creates a shield when your HP is low. The passive is **Lifeline**, which creates a shield that absorbs 510-1350 damage (increases with level), which lasts for 3 seconds when your HP drops below 30%. This effect has a cooldown of 40 seconds.\n\nThis item is ideal for heroes who want to survive against magic burst damage and deal physical damage, such as Popol, Saber, Layla, Lancelot, Hayabusa, Claude and Alpha. These heroes can use Rose Gold Meteor to protect themselves from dying and heal themselves with their lifesteal."},"scarletphantom":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEheln5gfDEkzOPyb2ZhDu35Fo5qJHjqaae8NtMt-SAYACcARz-M8b79ozHYeQCLPCdbCtJYkmp5pNMJ5ge_k9232vqUc4Q7Ve_wqeIoLqvY4zT-hXUQesG1fJDeXvjMLUesxz3TGCQS6nxfqSFGnNDU4QE2ODp-dHDt_SF5kiXsoiLzbFqnCgzt04qLtQ/s960/scarlet-phantom-png.png","name":"Scarlet Phantom","description":"**Scarlet Phantom**\n\nScarlet Phantom is an item that provides the following bonuses:\n\n- +30 Physical ATK\n- +20% Attack Speed\n- +25% Critical Chance\n\nThis item has a unique passive that increases your attack speed and critical chance when you land a critical hit. The passive is **Frenzy**, which increases your attack speed by 25% and critical chance by 5% for 2 seconds when you land a critical hit.\n\nThis item is ideal for heroes who rely on high attack speed and critical chance to deal more damage, such as Wanwan, Zilong, Yisunshin, Roger, Natalia, Moskov, Irithel, Hanabi, Freya, Clint and Alucard. These heroes can use Scarlet Phantom to deal more attacks faster and increase their chances of landing critical hits."},"seahalberd":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh5wYi3YNEdtizMoSP8PxOzKiflLjArWsttHs7x_Jgy7BfkcSp99JK6m4FKcgweBPtODyy_GS8Cd2c8Ux4CRybr0z16fCAse7XiitoqKmCHfkYjTaX3H3pjnChaDxuZZZSLISpPIaa0RJYfip7MsnW8yfYaF52Wr9E63-cL0Gg4BFlUrB9xL8H6mgbGMw/s949/sea-healberd-png.png","name":"Sea Halberd","description":"**Sea Halberd**\n\nSea Halberd is an item that provides the following bonuses:\n\n• +70 Physical ATK\n• +25% Attack Speed\n\nThis item has two unique passives that reduce the enemy's healing and deal more damage to enemies with high HP. The first one is **Life Drain**, which reduces the enemy's HP regen and shield effects by 50% for 3 seconds when you deal damage to them¹. The second one is **Punish**, which increases your damage by 8% against enemy heroes with higher extra HP.\n\nThis item is ideal for heroes who want to counter enemies who have high regen or lifesteal effects, such as Popol, Saber, Moskov, Granger, Karrie, and Claude. These heroes can use Sea Halberd to prevent the enemy from healing themselves and deal more damage based on their HP."},"waraxe":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEghH2rZdojf9dGh-mC534flj2ZQ6LrTIFjR7q750cKORYbAAiS9ZCSgUg7RELOfxfX1L0Nt1gNhqqzoWD6M2dLeor8-f1qvKs4Q_qOBmkHVgFlYM95TyHwikozVGZZNtqWSRygRA4QOQfexeDgAAjTDYYt3z2gi8cJPstt36FPqkoFltdSLEnQWECz6Kw/s1920/war-axe-png.png","name":"War Axe","description":"**War Axe**\n\nWar Axe is an item that provides the following bonuses:\n\n• +550 HP\n• +35 Physical ATK\n• +10% Cooldown Reduction\n\nThis item has a unique passive that increases your physical attack and penetration when you deal damage to enemies. The passive is **Fighting Spirit**, which increases your physical attack by 9 and physical penetration by 3 each second for 3 seconds when you deal damage to any enemy unit, to a max of 8 stacks. Marksmen, mages, and supports only receive 33% of these stacked effects. It also grants you 15% movement speed at full stacks.\n\nThis item is ideal for fighters who need good sustainability and damage output, such as Aulus, Thamuz, Yu Zhong, Ruby, Lapu-Lapu, Terizla, and Freya. These heroes can use War Axe to improve their durability, cooldown reduction, and damage potential."},"windof nature":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSYxyMVsYuU7hda1kh90H7KW_6OFOmlKdNaqOkftqhlBQD45LcwhvAiIZ6YE8AXqK3QkBdsVceUcp7VYSYcjQN2mkCv1JIYjUxIlvMQv5gWFrgV6rlY6dabxvlqlYQ-nXEwmymcP4Eoo720qSLlHHAPHCOjTE3-0yq8HxjuF1FIZPZMp3SZpBYkzohpw/s1920/wind-of-nature-png.png","name":"Wind of Nature","description":"**Wind of Nature**\n\nWind of Nature is an item that provides the following bonuses:\n\n• +30 Physical ATK\n• +20% Attack Speed\n• +10% Physical Lifesteal\n\nThis item has a unique active skill that makes you immune to physical damage for a short duration. The skill is **Nature Wind**, which makes you immune to all physical attacks for 2 seconds. There is a cooldown of 80 seconds. The duration is halved when the item is not used by a marksman.\n\nThis item is ideal for marksmen who want to survive against physical burst damage from enemies, such as Granger, Aldous, Helcurt, Hayabusa, and Claude. These marksmen can use Wind of Nature to protect themselves from dying and heal themselves with their lifesteal."},"windtalker":{"image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDR1fq2N8-Vf0x6-_bxDS7QmHLJLFk1IPtRRC8hZ17ByG-MwjDgy07eTjGjn1qdml2VCWbMR2vVWGL2nAnro1dZeH6xsn0i0oCevzsmY2Et6gMK8c7_ohjQMYpjww7YHc2K6PrT7jZXKsNsFja02DJvwMDEpe6y737O_DR-PENUoM2gnszDBYFblgNjQ/s1903/windtalker-png.png","name":"Windtalker","description":"**Windtalker**\n\nWindtalker is an item that provides the following bonuses:\n\n• +40% Attack Speed\n• +20 Movement Speed\n• +10% Critical Chance\n\nThis item has two unique passives that enhance your basic attacks with magic damage and movement speed. The first one is **Typhoon**, which makes your basic attacks every 3.5 seconds hit 3 enemy units and deal 100 magic damage. While your critical chance and attack speed increase, the cooldown of this effect decreases¹. The second one is **Activate**, which increases your movement speed by 5% for a short time each time Typhoon is used.\n\nThis item is ideal for marksmen who want to improve their attack speed and critical chance, such as Wanwan, Yisunshin, Lesley, Layla, Helcurt, Hanabi, Clint, Bruno, and Miya. These marksmen can use Windtalker to deal more attacks faster and deal extra magic damage with their basic attacks."}},"mage":{},"defend":{}}

