{"minsitthar":{"src":"http://mlbb.mobacompanion.com/wp-content/uploads/sites/2/2020/01/minsitthar_courageous_warrior-1024x576.jpg","role":"Fighter ","guide":"Minsitthar is a fighter hero who can disable enemies' movement skills and pull them with his spear. He is also durable and can deal decent damage with his passive and ultimate. Here is a possible guide for Minsitthar:\n\n# Minsitthar Guide\n\n## Emblem Set\n\nThe best emblem set for Minsitthar is the **Fighter Emblem**. You can choose the following talents:\n\n- **Bravery**: Increases your physical attack by 9 points.\n- **Invasion**: Increases your physical penetration by 6 points.\n- **Festival of Blood**: Increases your spell vamp by 8% and an extra 1% for each enemy hero you kill, up to 12%.\n\nThese talents will enhance your damage output and sustain in fights.\n\n## Battle Spell\n\nThe best battle spell for Minsitthar is **Flicker**. You can use it to escape, chase, or reposition yourself in team fights. You can also use it to combo with your first skill, Spear of Glory, to pull enemies further back.\n\n## Item Build\n\nThe best item build for Minsitthar is:\n\n- **Warrior Boots**: Increases your physical defense and movement speed. You can also choose Tough Boots if the enemy has a lot of magic damage or crowd control.\n- **Bloodlust Axe**: Increases your physical attack, cooldown reduction, and spell vamp. This item will help you heal from your skills and spam them more often.\n- **Blade of the Heptaseas**: Increases your physical attack, health, and physical penetration. This item will also deal extra damage to enemies who have not taken damage in the last 5 seconds, which works well with your first skill.\n- **Brute Force Breastplate**: Increases your physical defense, health, and movement speed. This item will also increase your physical and magic defense and movement speed every time you deal damage with basic attacks or skills, up to 5 times.\n- **Oracle**: Increases your magic defense, health, and cooldown reduction. This item will also enhance your shield effects by 30% and reduce the cooldown of regenerative effects by 15%, which works well with your passive and second skill.\n- **Immortality**: Increases your physical defense and health. This item will also revive you with some health and a shield after you die, once every 3 minutes.\n\n## Skill Combo\n\nThe basic skill combo for Minsitthar is:\n\n- Use Spear of Glory to pull an enemy hero or multiple enemies towards you.\n- Use Flicker if needed to pull them further back or reposition yourself.\n- Use Shield Assault to reduce incoming damage and deal more damage with basic attacks.\n- Use King's Calling to trap the enemies in a field and prevent them from using movement skills. The royal guards will also attack them and apply stacks of your passive.\n- Use basic attacks to detonate the stacks of your passive and stun the enemies.\n\nYou can also use King's Calling first to initiate a team fight and then use Spear of Glory to pull enemies who are trying to escape.\n","item":{"one":"warriorboots","two":"bloodlustaxe","three":"bladeoftheheptaseas","four":"bruteforcebreastplate","five":"oracle","six":"immortality"}},"thamuz":{"src":"http://mlbb.mobacompanion.com/wp-content/uploads/sites/2/2020/01/thamuz_lord_lava-1024x576.jpg","role":"Fighter ","guide":"\n- Thamuz's passive skill is **Grand Lord Lava**, which gives him a chance to deal true damage with his basic attacks and spout lava that creates a cauterant atmosphere around him³.\n- Thamuz's first skill is **Slaughterous Scythes**, which allows him to throw his scythes to a designated location, dealing physical damage and slowing enemies. The scythes will stay on the ground and can be retrieved by Thamuz or after 8 seconds³.\n- Thamuz's second skill is **Chasm Leap**, which lets him leap to a designated area, dealing physical damage and slowing enemies. If he lands on his scythes, the damage and slow effect will be increased³.\n- Thamuz's ultimate skill is **Cauterant Inferno**, which enhances his scythes with fire for 10 seconds, increasing his attack speed and physical lifesteal. He also deals extra physical damage equal to a percentage of the target's max HP with each basic attack³.\n- Thamuz is best played as an offlaner or a jungler, as he can clear waves and camps quickly with his skills and passive. He can also roam and gank effectively with his mobility and burst damage.\n- Thamuz should build items that boost his physical attack, attack speed, physical penetration, cooldown reduction, and durability. Some examples are **Warrior Boots**, **Bloodlust Axe**, **Blade of Despair**, **Endless Battle**, **Queen's Wings**, and **Malefic Roar**².\n- Thamuz should use the **Fighter Emblem Set** with points allocated to **Bravery**, **Invasion**, and **Festival of Blood**. The emblem talent should be **Festival of Blood** as well, which increases his physical lifesteal for each kill or assist².\n- Thamuz should choose the battle spell that suits his playstyle and team composition. Some options are **Retribution**, **Execute**, **Flicker**, and **Purify**².\n- Thamuz should be aggressive in the early game, as he can dominate most matchups with his high damage and sustain. He should also look for opportunities to join team fights and secure objectives with his ultimate.\n- Thamuz should be careful of enemies who have high burst damage, crowd control, or mobility, as they can counter his playstyle. Some examples are **Lesley**, **Odette**, **Natalia**, **Moskov**, and **Johnson**². He should also avoid diving too deep into enemy territory without backup or vision.\n","item":{"one":"warriorboots","two":"bloodlustaxe","three":"bladeofdespair","four":"endlessbattle","five":"queen’swings","six":"maleficroar"}}}

